{
  "cain" : {
    "name" : "Deckard Cain",
    "quotes" : [
      "Good afternoon.",
      "Good day.",
      "Good evening.",
      "Good morning.",
      "Good to see you!",
      "Greetings.",
      "Hello.",
      "I have a quest for you.",
      "I have a reward for you!",
      "I have news for you.",
      "Stay a while and listen.",
      "Yes?",
      "You have returned!",
      "...I thank you, friend, for coming to my aid.",
      "Oh... Blessings on the Rogues! They finally rescued me from that cursed place!",
      "Regrettably, I could do nothing to prevent the disaster which devastated Tristram. It would appear that our greatest fears have come to pass. Diablo, the Lord of Terror, has once again been set loose upon the world!",
      "As you know, some time ago Diablo was slain beneath Tristram. And when our hero emerged triumphant from the labyrinth beneath town, we held a grand celebration that lasted several days.",
      "Yet, as the weeks passed, our hero became increasingly aloof. He kept his distance from the rest of the townsfolk and seemed to lapse into a dark, brooding depression. I thought that perhaps his ordeal had been so disturbing that he simply could not put it out of his mind.",
      "The hero seemed more tormented every passing day. I remember he awoke many times -- screaming in the night -- always something about 'the East'.",
      "One day, he simply left. And shortly thereafter Tristram was attacked by legions of foul demons. Many were slain, and the demons left me to die in that cursed cage.",
      "I believe now that Tristram's hero was that Dark Wanderer who passed this way before the Monastery fell.",
      "I fear even worse, my friend... I fear that Diablo has taken possession of the hero who sought to slay him. If true, Diablo will become more powerful than ever before.",
      "You must stop him or all will be lost.",
      "That tower marks a place of danger. There is an epic poem about it... How much sorrow one can stand was tested there.",
      "Quickly in and quickly out is all the advice I can give you.",
      "Well done, my friend. Courage and opportunity together have created in you a kind of alchemy.",
      "The Malus was forged and enchanted by the ancient Horadric Mages during the Sin Wars. When their union dissolved, the Malus was entrusted to the Sisterhood guarding the pass into the East.",
      "The Malus has eluded you so far. Well, search thoroughly in the Barracks... That is where the Rogues kept their forge.",
      "The magical effects imbued by the Malus are impossible to predict, but are always to the good.",
      "It is certain that we face the demon queen, Andariel, who has corrupted the Rogue Sisterhood and defiled their ancestral Monastery. This does not bode well for us, my friend.",
      "Ancient Horadric texts record that Andariel and the other Lesser Evils once overthrew the three Prime Evils -- Diablo, Mephisto and Baal -- banishing them from Hell to our world. Here, they caused mankind untold anguish and suffering before they were finally bound within the Soulstones.",
      "Andariel's presence here could mean that the forces of Hell are once again aligned behind Diablo and his Brothers. If this is true, then I fear for us all.",
      "You must kill her before the Monastery becomes a permanent outpost of Hell and the way east lost forever.",
      "Diablo is heading east for some foul purpose. And the only passage east is through the Monastery gate. Obviously, Diablo summoned Andariel to block any pursuit.",
      "For her part Andariel hopes to win Diablo's favor... the lesser demons are always vying for positions of power within the unholy hierarchy!",
      "It is clear that Andariel is acting on behalf of Diablo to prevent anyone from following him eastward. Her defeat would allow you to continue the pursuit.",
      "Ancient lore has it that while Andariel was spawned in the Burning Hells, she is not fond of fire.",
      "This is a great victory indeed, but many more battles await. I will accompany you on your journey, lending what assistance I can...",
      "Remember... Diablo is still out there, seeking something in the desert. I'm afraid that this nightmare will not end until you find what it is that he seeks.",
      "Long ago, the Soulstones were given to the Horadrim by the Archangel Tyrael. They were used to bind the three Prime Evils. I now know that even these holy artifacts were no match for Diablo's power.",
      "I hope that his two brothers are more securely held... but I fear the worst.",
      "It takes time to master your skills... and use will hone your technique. But take care to choose your new skills wisely.",
      "You may recover some mysterious things from the demons you kill. Some of great use to you... some of great peril! Bring them to me and I'll reveal their secrets.",
      "Have I told you about the Horadrim? They were an ancient confederation of mage-clans who sought to bind the three Prime Evils for eternity. The Horadrim are now nearly forgotten... and it appears that the bonds they wove are unravelling!",
      "As the last of the Horadrim, I pray that I can help you remedy their failure.",
      "Long ago, Diablo and his brothers were cast out of Hell by the Lesser Evils. It seems that Hell's balance has shifted, as Andariel is now aligned with the Lord of Terror. Her presence here in the mortal realm does not bode well for us.",
      "The Horadrim used to mummify their highest mages, and infuse them with spells that would allow them to protect their tombs, even after death.",
      "I have no idea why one of them would be acting so malevolently. Perhaps Drognan or Fara would know more about this.",
      "The Horadric mummies were created to protect the tombs, but Radament is far from his burial chamber. Given the aberrations that have been witnessed lately, it comes as no surprise that even the ancient guardian spells have begun to unravel. Be wary of this as you venture farther into the desert.",
      "If you haven't already, tell Atma that Radament is dead. It may help to ease the weight of her mourning.",
      "Ahh... The lost Horadric Scroll! What a fortunate turn of events...",
      "As the last living Horadrim, I alone have knowledge of its meaning. Now, to read the Horadric runes it bears. Hmmm...",
      "The Horadric Mages, after binding Baal within Tal Rasha, magically sealed off his Burial Chamber from the mortal realm. Those same Mages also crafted fearsome Horadric Staves and imbued them with the special power to open the Chamber's hidden door.",
      "After nearly losing one to the thievery of a rogue sorcerer, they divided all the Horadric Staves into two parts - wooden shaft and metal headpiece - hiding them separately to safeguard them.",
      "The Horadrim foresaw our current plight and designed the hiding places to reveal themselves to worthy heroes like you.",
      "Collect both parts of a Horadric Staff and unite them using a Horadric Cube. Then, you may enter Tal Rasha's Burial Chamber.",
      "You have quite a treasure there in that Horadric Cube. According to Horadric lore, the Cube can restore a Horadric Staff.",
      "To do it - use the Cube as you would a scroll. When the Cube opens, place both pieces of the Staff into it and use the Cube's transmute power.",
      "You'll be pleased to know that the Cube has other alchemical uses as well...",
      "Six gems plus one sword transmute into a socketed long sword.",
      "You may also transmute two quivers of crossbow bolts into one quiver of arrows, while two quivers of arrows yield one quiver of bolts.",
      "I must leave it to you to discover other formulae.",
      "The Staff of Kings! You astound me, my friend. You have discovered the shaft portion of a Horadric Staff.",
      "I trust you know how to use a Horadric Cube to unite the shaft with its headpiece.",
      "The Viper Amulet you bear is actually the headpiece of a Horadric Staff!",
      "Yes... You have an uncanny knack for finding rare and valuable artifacts. Of course, you'll have to use a Horadric Cube to combine the headpiece with the shaft.",
      "Excellent! You have a Horadric Staff.",
      "Carry it with you into Tal Rasha's Tomb. Find within the Tomb the chamber whose floor is inset with the Circle of Seven Symbols.",
      "Place the Staff into the receptacle you find there. That will open the secret passage into Tal Rasha's Burial Chamber.",
      "But, be prepared for a fight - you'll likely have to kill Tal Rasha to destroy Baal.",
      "Drognan may have some advice on this matter. Hmm... I think I'll speak with him myself.",
      "The source of this spell is probably a magical altar. It will not be enough to kill the Claw Vipers. To reverse the spell you must destroy the altar.",
      "I've been speaking with Lord Jerhyn, and I sense that he is becoming more and more agitated by something. You should try to talk to him again.",
      "If he still won't take you into his confidence, seek to prove yourself a bit more. I gather that his respect for you is growing.",
      "I very much doubt that Horazon still lives in his Sanctuary. He possessed great power and influence over demons, but even that may not have been enough in the end. One of his notoriety cannot easily remove himself from the vengeful reach of Hell.",
      "I've been thinking about the problems in Jerhyn's palace. Perhaps this has occurred to you as well...",
      "If those cellar passageways lead to the Arcane Sanctuary, then that is where the demons came from. Horazon's haven must have been breached!",
      "You must move quickly now, friend, for Diablo is undoubtedly close to finding what he seeks. Find the Tomb of Tal Rasha before he frees the Lord of Destruction.",
      "The appearance of the mage you describe sounds like one I met back in Tristram. Many Vizjerei came to fight against Diablo, the Lord of Terror. Perhaps, this is one of them.",
      "You know, fate seems to have frowned upon all of the heroes who confronted that terrible Evil. Take care or the same may happen to you.",
      "I hope that this false Summoner found peace in death. Unfortunately, it is more likely that he will be dragged down into Hell by the demons he was bound to.",
      "Let this be a lesson to you... Demonic magic is a quick path, but its powers are seductive and deadly.",
      "Diablo nears his goal. We have little time to lose.",
      "Remember, my friend, that Andariel gave herself willingly to Diablo's cause. It would be prudent to assume that the other Evils will attempt to aid their master as well.",
      "The Archangel Tyrael was the one who gave the Soulstones to the Horadrim two hundred and sixty years ago.",
      "It is highly unusual for the forces of Heaven to so directly interfere with man's destiny, but Tyrael was said to act of his own volition. We have never been able to discern why.",
      "Perhaps, he goes against the consensus of Heaven because he doubts our ability to defend ourselves, or perhaps, he sees more threat than his peers.",
      "Where the actions of Hell often seem straightforwardly bent on destruction, the motives of Heaven are unfathomable.",
      "Now make haste... Both Diablo and Baal must be stopped before they join with their brother, Mephisto. If the three Prime Evils unite once again, the world as we know it will be no more.",
      "Elzix is quite a scoundrel, but I like him all the same.",
      "There is something about Fara that troubles me. Her manner is strange for a lonely desert-maid.",
      "Greetings, my friend. Have you spoken to Jerhyn yet? He's quite a remarkable leader for being such a young man. Then again, the old blood has always run strong in this land.",
      "Meshif is an interesting man. Part of him longs for the freedom of the open seas... Yet his heart belongs in his homeland.",
      "I talked at length with Warriv as we crossed the desert from Khanduras. He has many fascinating tales of the dangers in the desert. His experience may be useful to you.",
      "I've not set foot in glorious Kurast for many years. But I never would have imagined it could be so corrupted.",
      "Certainly, this must be Mephisto's work! You'd best get going, my friend. Diablo and Baal are still out there and you must find them.",
      "Back in Lut Gholein Meshif told me he had a fondness for jade figurines. On his trading voyages he collected an odd assortment of such small statues.",
      "I would show him your figurine.",
      "I've read legends about a sage named Ku Y'leh, who studied the mysteries of life beyond death.",
      "If I remember correctly, his ashes were ensconced within a golden statuette. It was a very strange tale.",
      "So, Meshif had the Golden Bird all along. I wonder if he knows what he gave up for that jade figurine.",
      "I've done some research on the Taan mage-clan, and it seems that most of their magical studies were focused on Skatsimi rites.",
      "If anyone is qualified to use the powers of the Gidbinn, it would be Ormus.",
      "Since you haven't come across the Gidbinn yet, the dagger must be deeper in the jungle nearer Kurast.",
      "Who could have foreseen that the Old Religion would play such an effective role in our war against the Three? Again, your efforts amaze me, my friend.",
      "Never forget that your ultimate purpose here in Kurast is to destroy Mephisto. The ancient Horadrim imprisoned the Lord of Hatred inside the Guardian Tower that is located within the Temple City of Travincal.",
      "Know this, friend. The only way to gain entry to Mephisto's prison is to destroy the artifact known as the Compelling Orb.",
      "Mephisto used this device to control the Zakarum Priests and their followers. The Orb can only be destroyed with an ancient flail imbued with the spirit of the one incorruptible priest.",
      "Soon after his imprisonment, Mephisto worked his evil corruption on the Zakarum priesthood. All were turned to his dark ways, save one - Khalim, the Que-Hegan of the High Council.",
      "Mephisto directed the other Council priests to slay and dismember Khalim and then scatter his remains across the Kingdom. The Priest Sankekur succeeded Khalim as Que-Hegan, eventually becoming the embodiment of Mephisto here on the mortal plane.",
      "The corrupted High Council fashioned an Orb to control the rest of the Zakarum faithful and used their powers to hide the lair of their master from mortals.",
      "Your task is to collect the scattered relics of Khalim - his Heart, his Brain, and his Eye. Then, using the Horadric Cube, transmute Khalim's Flail with his relics.",
      "Once this is accomplished, you must destroy the Compelling Orb with Khalim's Will to open the way into the corrupt sanctum of Mephisto.",
      "Ahh... Khalim's Eye! Only it can reveal the true path to Mephisto.",
      "Place the Eye in the Horadric Cube along with Khalim's other relics - the Heart, the Brain, and the Flail.",
      "This is most fortunate! Khalim's Brain knows Mephisto's weakness.",
      "Place it in the Horadric Cube along with Khalim's other relics - the Eye, the Heart, and the Flail.",
      "You have found Khalim's Heart, and it still bears the courage to face Mephisto!",
      "Place it in the Horadric Cube along with Khalim's other relics - the Eye, the Brain, and the Flail.",
      "Once properly imbued, Khalim's Flail can destroy the Compelling Orb and reveal the way to Mephisto.",
      "Place it into the Horadric Cube along with Khalim's relics - his Heart, his Brain, and his Eye. Then, transmute them to carry out Khalim's Will.",
      "Masterfully done, hero! You have crafted Khalim's Will. Employ it to destroy the Compelling Orb and open the way to Mephisto.",
      "May the true Light guide your way.",
      "The Black Book is a powerful source of information. The Zakarum will do everything in their power to stop you from obtaining it.",
      "I heard that there are ruined temples in Kurast. Perhaps you will find the Black Book in one of them.",
      "You have found a source of information powerful enough to turn the tide against the Zakarum.",
      "Ormus tells me that the Council is comprised of tremendously powerful priests. It will be difficult to best them.",
      "The Temple City is well guarded. You'd best keep your wits about you.",
      "Sankekur may be using a Compelling Orb to control the minds of the Children of Zakarum.",
      "Ridding Kurast of the Council of Zakarum was essential. Still, there is more you must do. The Compelling Orb, too, must be destroyed.",
      "Diablo and Baal must be close to finding their brother, Mephisto, by now. You've no time to waste.",
      "You must reach Mephisto before his brothers do.",
      "The ancient Horadrim always feared that the Three would escape their prisons and unite. I can't believe that I, the last of their Order, have seen it come to pass.",
      "You are the only one who can prevent this, my friend. The final hour draws near.",
      "Search the Tower thoroughly. Mephisto must not escape.",
      "Our faith in you was well deserved. But Diablo has made his way to Hell; and it is likely that Baal followed him there.",
      "Enter the Infernal Gate and kill the Lord of Terror before all is lost. Only then will our world be saved!",
      "Asheara seems like a very tough woman. I'd be careful around her if I were you.",
      "Drognan told me of Hratli when we were in Lut Gholein. He said that he weaves magic into his forge and produces mystical weapons and armor.",
      "His skills could be quite useful to you.",
      "Seeing his homeland in such a state must be horrifying to Meshif. I'm surprised he's willing to remain here in order to help you.",
      "Have you met, Natalya? She appears to be a member of the Khral-Harzhek, a secret order that has been around for centuries... almost as long as the Horadrim, itself.",
      "Her presence here makes me uneasy, for they are traditionally sworn to hunt down Magi who have betrayed the trust of their order.",
      "I wonder why she is here.",
      "Judging from his dress and strange markings, I would guess that Ormus is from the ancient Taan mage-clan. Yet none of the others here seem to know that he is a sorcerer.",
      "The Taan were once as powerful as the Vizjerei clan, but their studies were even more secretive. I wonder what he's hiding.",
      "Ormus would like you to think him mad. Better to watch his actions than listen to his words.",
      "Hello, my friend. I was hoping you'd return. It gets very unnerving here...especially when I'm alone.",
      "Can you believe this place? Did you ever dare to dream that you'd one day stand upon the crossroads between Heaven and Hell? This Pandemonium Fortress is truly miraculous.",
      "However, your journey is not yet over. Diablo still roams free in Hell, marshalling his demonic forces. Only when he is beaten will our world finally have peace.",
      "Hurry now... the sands of time slow for no one!",
      "Tyrael has asked you to confront Izual the Fallen? He must have great faith in your abilities!",
      "I trust you know what you're doing... Be careful. You're our last hope.",
      "Having trouble finding the Fallen Angel, eh?",
      "You'd better hurry. It's beginning to feel like some great evil is permeating the air around here.",
      "You're lucky to be alive, my friend! It is imperative that you find and stop Diablo!",
      "You should speak of this with Tyrael. He will know what to make of this.",
      "The time has come for you to destroy Mephisto's Soulstone!",
      "Take the Stone to the Hellforge. Place it upon the forge and strike it soundly with the Hammer.",
      "Only by doing this can you prevent Mephisto from manifesting in this world ever again.",
      "The time has come to destroy Mephisto's Soulstone!",
      "Although I picked it up before entering the Infernal Gate, I believe you should carry out this crucial mission.",
      "Take the Stone to the Hellforge. Place it upon the forge and strike it soundly with the Hammer.",
      "Only by doing this can you prevent Mephisto from manifesting in this world ever again.",
      "Congratulations, hero!",
      "Surely, even Diablo, himself, sensed the fury unleashed when you smashed his Brother's Soulstone.",
      "You don't have time to dally about here!",
      "Diablo awaits you in Hell. Remember... Diablo's greatest weapon against you is Terror.",
      "Don't give in to your fears. Resist his power and put an end to him for good!",
      "I knew there was great potential in you, my friend. You've done a fantastic job.",
      "Though my ancestors often struggled against the Three Evils and their minions, I've always lived a shut-in, scholarly life. I'm glad that my wisdom aided you.",
      "Now, I wish to leave this place. Though Heaven's Gates are a marvel to behold, I hope I won't have to see them again for many, many years.",
      "Please talk to Tyrael about leaving this place now!",
      "I have read much about the enigmatic Archangel Tyrael. He was revered in Horadrim lore both for his compassion for mortals and his unquenchable spirit.",
      "It was rumored that he went against the wishes of Heaven and gave the Horadrim the original Soulstones in order to trap Diablo and his Brothers.",
      "I am amazed to find this place so untouched. Everything else in the path of Baal the Lord of Destruction lies in ruin.",
      "These Barbarians must indeed be the legendary guardians of Mount Arreat. They are a proud, hardy people. Don't expect to be greeted warmly -- strangers here rarely are.",
      "Perhaps I can gain their trust. I'll spend some time with the townsfolk and try to understand them better. I'll let you know what I discover.",
      "I believe that stopping the siege on Harrogath is the only way for you to earn the trust of these people.",
      "I understand your reluctance, but now is the time to strike.",
      "Those catapults were like nothing I have ever seen before. You have prevailed against Shenk, my friend, but Baal is still far ahead of you.",
      "I know firsthand that captivity is a sad fate for a man. Find them quickly.",
      "If you are having trouble finding Qual-Kehk's soldiers, you should talk to Malah. She healed those who made it back before. Perhaps she would have some advice.",
      "You've become a hero to this town, my friend. The shadows have lifted ever since you brought the Light to Harrogath.",
      "I would listen to Malah. Nihlathak speaks with a venomous tongue and acts as if the entire weight of this town rests upon his shoulders.",
      "Perhaps there is more going on here than we know.",
      "Nihlathak's story does sound reasonable, considering what I've heard about Anya. However, the best lies are often hidden within truth.",
      "Goodness! Anya frozen by that fallen Barbarian, Nihlathak...Perhaps Malah can help you where I cannot.",
      "For one so young, Anya commands great respect. Now that she is here, I will make it a point to talk to her about Mount Arreat.",
      "You should do the same.",
      "Regretfully, I know very little about this Relic. However, if what the others say is true, then Baal must not gain possession of it.",
      "Stop Nihlathak...before all is lost.",
      "Ohh...This is a truly horrible turn of events.",
      "I know it seems you have always been one step behind, my friend. But look at it this way...You have evil on the run.",
      "Beware! Baal grows stronger with every passing moment.",
      "A test of mettle is a fitting rite of passage for a Barbarian hero.",
      "We have come too far to be defeated now, my friend. I have seen you complete many difficult quests. Though this may be your greatest trial, it is not beyond your reach.",
      "You have proven yourself to these people. They look to you as their warrior, their champion.",
      "Remember this. Baal once possessed Tal Rasha, one of the most powerful of the ancient Horadrim.",
      "Your battles with Mephisto and Diablo will pale in comparison to your battle with Baal.",
      "The Lord of Destruction aided by Tal Rasha's knowledge...The mountain itself will tremble when you clash.",
      "I knew in time you would defeat Baal. You have done everything you set out to do, my friend.",
      "Ever since you rescued me from Tristram, I have believed in you. It has been a supreme honor to aid you along the way.",
      "So...The Worldstone was corrupted by Baal. And now Tyrael must destroy it. Worry not. Through whatever lies ahead I have faith that the Light will guide us both.",
      "Go, now, back to the Worldstone chamber, and enter the portal Tyrael has opened for you.",
      "With hellspawn, size is no measure of their threat. Demons half the size of men can kill with a gesture, while hellish pack animals trample any who stand in their way.",
      "Though these Barbarians are known throughout the kingdoms as ferocious fighters, they are also capable of great compassion.",
      "They have trained throughout history for a battle their legends foretell will decide the fate of the world.",
      "The angel Tyrael has watched over the guardians of Arreat throughout history. I do not believe that Baal and Tyrael have come to fight over a paltry few souls.",
      "They are here to settle a conflict as old as time itself.",
      "During my time with the Horadrim, we often debated the nature of Mount Arreat.",
      "We knew that the Barbarian clans zealously guarded the mountain as their sacred duty. However, many dismissed their zeal as simple superstition...combined with an inborn hostility toward outsiders.",
      "Those Horadrim who trekked up Arreat were never heard from again...Still, I do not believe they died at the hands of Barbarians.",
      "All users of the magical arts know of Mount Arreat, but few understand its true nature. It is the nexus of an unfathomable magic.",
      "It bodes ill that the Lord of Destruction races to its summit with such purpose. I fear for the whole world should Baal gain what he seeks.",
      "I have spent decades trying to understand the forces at work in this world. But in the face of all that is transpiring, I realize how meager my knowledge is.",
      "I will be of assistance where I can, my friend.",
      "Though the Elder Council of Harrogath is gone, there are many capable young leaders to take their place.",
      "Anya certainly has enough courage and intelligence to lead them all, if they can survive this catastrophe.",
      "It is my belief that the Soulstones are at the center of this conflict. If only that fool Marius had not intervened, Baal would still be imprisoned within Tal Rasha.",
      "Ah, Anya. Such a fine example of feminine strength...",
      "She reminds me of the Zakarum priestesses I knew in my youth. They don't take vows of chastity, you know.",
      "It is fortunate that this town has such a talented smith.",
      "The quality of Larzuk's work surely complements your skills. In fact, he would have been quite welcome amongst the Horadrim."]
  },

  "tyrael" : {
    "name" : "Tyrael",
    "quotes" : [
      "I thank you, mortal, for my freedom. But I did expect you earlier.",
      "I am the Archangel Tyrael. I came here to prevent Diablo from freeing his brother, Baal. But I have failed. Now, Terror and Destruction roam free throughout your world.",
      "Even now, they head towards the Eastern capital of Kurast - to the very heart of the Zakarum Temple. There they hope to find their eldest brother, Mephisto, the Lord of Hatred who was imprisoned there ages ago.",
      "If the three Prime Evils unite, they will be invincible. Though it is unclear as to what their aims are, it is certain that they must be stopped at all costs.",
      "I am broken and the energies that tie me to this world are diminishing rapidly.",
      "You must take up this quest and prevent the Three Brothers from reuniting. You must cross the sea and search for Diablo and Baal in Kurast.",
      "Now hurry, mortal... Time is running out for all of us!",
      "Farewell.",
      "Godspeed.",
      "Goodbye.",
      "Good to see you.",
      "Good to see you again.",
      "Greetings.",
      "Greetings, mortal. I knew you'd find your way back here.",
      "Hail to you, champion.",
      "Hello.",
      "I need your help.",
      "Thank you.",
      "Welcome, avenger.",
      "What can I do for you?",
      "What do you need?",
      "Yes?",
      "Your presence honors me.",
      "It is good to see you again, hero.",
      "Mephisto's defeat is a great victory for the Light. I knew that you would eventually find your way here. The Pandemonium Fortress is the last bastion of Heaven's power before the Gates of the Burning Hells.",
      "This place has been hallowed by the blood of thousands of champions of the Light, many of whom were mortal, like yourself. Now the final battle against the Prime Evils draws near... and you must face it alone.",
      "I have been forbidden to aid you directly, save for a few bits of wisdom. For this is the hour of mortal Man's triumph...your triumph.",
      "May the Light protect you and the powers of Heaven shine upon your path...",
      "There is a dark, tortured soul who was trapped within this forsaken realm long ago. He was called Izual by mortal men, and in ages past he was my most trusted Lieutenant.",
      "Yet, against my wishes he led an ill-fated assault upon the fiery Hellforge, itself.",
      "Despite his valor and strength, Izual was captured by the Prime Evils and twisted by their perverse power. They forced him to betray his own kind and give up Heaven's most guarded secrets.",
      "He became a corrupt shadow of his former self - a fallen angel trusted neither by Heaven nor Hell.",
      "For his transgressions, Izual's spirit was bound within the form of a terrible creature which was summoned from the Abyss. His maddened spirit has resided within that tortured husk for many ages now.",
      "It seems to me that he has suffered long enough. I implore you, hero, find Izual and release him from his cruel imprisonment.",
      "Put an end to his guilt and suffering.",
      "Though Izual no longer carries the Angelic Runeblade, Azurewrath, he may still possess great strength and power within his new form.",
      "Also, he may not be able to tell friend from foe while in his present state. If you find him, he will almost certainly be hostile.",
      "Proceed with the utmost caution.",
      "You mustn't delay, mortal hero. Izual must be put to rest, but Diablo still lurks within this realm.",
      "Go now... Hurry!",
      "Thank you, hero, for putting Izual's tortured spirit to rest. May the Light protect you and the powers of Heaven shine upon your path.",
      "But, if what you tell me is true, then I fear that we have been played for fools all along.",
      "Izual helped Diablo and his Brothers trick me into using the Soulstones against them... Now the Stones' powers are corrupted.",
      "With the combined powers of the Soulstones under their control, the Prime Evils will be able to turn the mortal world into a permanent outpost of Hell!",
      "The time has come to hunt down and destroy Diablo, himself.",
      "But beware, the Lord of Terror is not to be underestimated. He single-handedly destroyed the town of Tristram and corrupted the last noble hero who tried to stop him.",
      "This time, you must defeat him for good. Only by destroying the Soulstone which he carries will his spirit be banished forever.",
      "Good luck! Though this be our darkest hour, it may yet be your greatest moment.",
      "Praise be to the Light! You have accomplished the impossible!",
      "Diablo and Mephisto have been banished back into the Black Abyss that spawned them and the corrupted Soulstones are no more.",
      "You've done well, hero. For now, you should rejoice.",
      "However, while you were fighting here, Baal remained behind in the mortal realm, building an army of hellish minions. Now, Baal's army is searching for the Worldstone, the ancient source of all the Soulstones and their power, while leaving behind a wake of destruction. They have forged deeply into the Barbarian homelands, heading directly for the summit of Mount Arreat!",
      "Baal knows, mortal hero! That is the very site of the blessed Worldstone!",
      "Now, enter the portal I have opened for you. It will take you to the Barbarian city of Harrogath, the last bastion of Order on the slopes of Arreat.",
      "Long ago, I swore an oath to watch over the Horadrim and their descendants.",
      "As Deckard Cain is the last of their esteemed Order, I will not allow him to perish here so far from the lands of his birth.",
      "Be at ease, hero, I know that he is your friend. He shall come to no harm.",
      "I am impressed, mortal. You have overcome the greatest challenge this world has ever faced and defeated the last of the Prime Evils. However, we are too late to save the Worldstone. Baal's destructive touch has corrupted it completely. ",
      "Given enough time, the Worldstone's energies will drain away and the barriers between the worlds will shatter -- the powers of Hell will flood into this...Sanctuary...and eradicate your people and everything you've labored to build. ",
      "Therefore, I must destroy the corrupted Worldstone before the powers of Hell take root. This act will change your world forever -- with consequences even I cannot foresee. However, it is the only way to ensure mankind's survival. ",
      "Go now, mortal. I have opened a portal that will lead you to safety. ",
      "May the Eternal Light shine upon you and your descendants for what you've done this day. The continued survival of mankind is your legacy! Above all else, you have earned a rest from this endless battle.",
      "Hope remains within the hearts of men."
    ]
  },
  "diablo" : {
    "name" : "Diablo",
    "quotes" : [
        "Aggh... The smell of life surrounds me.",
        "Not even death can save you from me..."
    ]
  },
  "izual" : {
    "name" : "Izual",
    "quotes" : [
        "Save yourself!",
        "Leave me!",
        "You cannot help me!"
    ]
  },
  "andariel" : {
    "name" : "Andariel",
    "quotes" : [
        "Die, maggot.",
        "Fear me!",
        "The East is beyond your grasp."
    ]
  },
  "mephisto" : {
    "name" : "Mephisto",
    "quotes" : [
        "My brothers have escaped you.",
        "You're too late, ha ha ha ha ha ha."
    ]
  },
  "baal" : {
    "name" : "Baal",
    "quotes" : [
        "My brothers will not have died in vain!",
        "Aaaaggghhh...",
        "(Maniacal Laughter)."
    ]
  },
  "atma" : {
    "name" : "Atma",
    "quotes" : [
        "Farewell.",
        "Goodbye.",
        "Good day.",
        "Good evening.",
        "Good morning.",
        "Greetings.",
        "Greetings, hero.",
        "Hello.",
        "Hello again. Things have been very quiet around here since you left.",
        "I need you help.",
        "Return, anytime.",
        "Tell me your troubles.",
        "There's no trouble a mug can't cure.",
        "Yes?",
        "You'll forgive me if I seem upset. I've suffered a loss recently, but that's not your problem.",
        "It's a relief to see some proper warriors come through here. My name is Atma.  I run the tavern here in Lut Gholein.",
        "I don't expect this of you, but if you want to help me, I would be grateful.",
        "In the sewers below our city, there lurks a horrid creature that hungers for human flesh. The creature has killed many, including my son and my husband.",
        "If you destroy it, I will reward you. Please be careful though, that beast has taken enough from us already.",
        "The sewer entrance is through the trap door just up the street.",
        "The creature makes its lair in the tunnels beneath this city. He butchered my husband and son... I simply cannot bear to talk about it...",
        "I am starting to have second thoughts about my request... I couldn't bear the thought of you losing your life on my behalf.",
        "Please be careful.",
        "They say that the taste of vengeance is bittersweet, but I find it to my liking.",
        "In addition to my undying gratitude, I have spoken on your behalf with the rest of the townspeople. The merchants have agreed to show their gratitude by offering their wares and services at lower rates.",
        "Oh... Jerhyn wants to see you, too. You'll find him in front of the palace.",
        "Drognan, the wizard, will have some idea as to what is happening.",
        "I was going to go to bed, but then I realized that I have no idea what time it is. It could be the crack of dawn, for all I know.",
        "You have done well to restore light to our world.",
        "Arcane Sanctuary? That place sounds awful! Even if you find a way into it, what makes you think you'll be able to leave again?",
        "So you've been in the palace, have you? Tell me, why does Jerhyn keep that place locked up so tight?",
        "Oh, those poor women! Will the slaughter never end? Thank you once again for protecting our city.",
        "You always seem to find the worst trouble. I don't know how you handle it.",
        "You're more the hero than I could have dreamed. Perhaps, there is hope for us after all.",
        "I've heard legends of the Tomb of Tal Rasha, but I thought they were just old tales meant to scare young children.",
        "You have proven to be the greatest of heroes, and I am honored to call you friend. Thank you for bringing peace to our lives again.",
        "Evil has laid siege to Lut Gholein and you may be our last hope...",
        "This public house used to be quite lively, until this plague of evil. Luckily, I've managed to save away a tidy nest egg. Unfortunately, I couldn't save everything I cared for...",
        "In addition to my public house, there used to be several brothels doing business here. When the troubles first started in the desert, the harem guilds sought sanctuary within the palace.",
        "Of course, Jerhyn was glad to oblige. I'll bet they're finding many ways to repay him for his protection.",
        "Drognan is a very private person. He's always studying ancient scrolls and such. He may be a mystery to me forever.",
        "Elzix and I have reached an understanding over the years. He sends travelers to me for drink and entertainment, and I send them back to him for a soft bed. The travelers often trade their wares for lodging.",
        "Geglash may seem like a sot, but he's a brave man. All this trouble has driven him to drinking more than his usual.",
        "Oh, Lysander is cranky, but he's a good old man. He used to give me medicines when... my son was ill.",
        "Meshif seldom patronizes my establishment. I think he prefers to stay out there on his leaky ship."
    ]
  },
  "gheed" : {
    "name" : "Gheed",
    "quotes" : [
        "Farewell.",
        "Goodbye.",
        "Good day.",
        "Good evening.",
        "Good morning.",
        "Good to see you again. Since the Rogues have been moving back into their monastery, they haven't been buying anything from me!",
        "Greetings.",
        "Hello.",
        "Let's deal, my friend.",
        "May I help you?",
        "I need your help.",
        "What'cha need?",
        "Yes?",
        "Good day to you partner! I'm Gheed and I can already tell that I'll be your best friend in this forsaken camp.",
        "A spare weapon, some gold, a small gem is all I want in exchange for the equipment you'll need on whatever quests you might undertake.",
        "Now, now, now... Don't be shy, all of my items are guaranteed for life and come with a two-day warranty!",
        "A Necromancer! I hoped I'd never have to lay my eyes on one of your kind again. ... The recent troubles in this area have brought out all kinds, I see.  Nevertheless, your money's good...",
        "A spare weapon, some gold, a small gem is all I want in exchange for the equipment you'll need on whatever quests you might undertake!",
        "Now, now, now... Don't be shy, all of my items are guaranteed for life and come with a two-day warranty!",
        "You're a brave soul! I'd sooner thrust my sacred scepter into the foulest, carbuncular trull than set one boot into that cave.",
        "Demons still befouling that cave, huh? I think you might need a new weapon.",
        "The only good demon is a dead one, I say.",
        "By the way, did you happen to find anything in that cave you'd like to sell?",
        "I'm sorry... The undead are bad for trade. I have a strict no-return policy.",
        "I wonder if that old gossip, Melra, is among the undead? Oh, she had dirt on everybody.",
        "Some of those gals weren't so nice the first time around.",
        "I would sooner micturate in a tankard of my own ale than journey to Tristram!",
        "Barking up the wrong tree, huh? You'll find it, just keep looking.",
        "Look, friend... I trade a lot of strange items, but I'm not going to start dealing in bark. Okay?",
        "I'm told that Tristram now resembles a mead hall... after a Barbarian wedding!  I will wait here for your most glorious return.",
        "Ah, Cain is here... another customer. I haven't been this pleased since a love-starved maiden let down a bit more than her hair.",
        "The only wealth you're likely to find there is a wealth of vermin.",
        "Guess what! I've named a boil on my ass after you. It, too, bothers me every time I sit down.",
        "Warriv's advice is like corpse gas; it befouls the air for a moment and then it disappears.",
        "Charsi talks of nothing anymore, but this Horadric Malus. Between you and her my ears need a rest.",
        "Just find it and bring it back quickly.",
        "I have heard that you bear us no Malus.",
        "I guess it's too late to take back some of the names I called you.",
        "You're going after Andariel?",
        "... One of my wagon wheels is in need of repair. I'll be under the wagon, if I'm needed.",
        "Have you stumbled upon that Demon Queen, yet? I hear she's quite the beauty...  as far as Maidens of Anguish go, that is.",
        "I'm going to party like it's 999!",
        "Andariel's demonic forces have taken up residence in the forests as well as the Monastery. Uh-uh. I won't be venturing out of the camp. So, if you need anything, I'll be right here.",
        "When - or if - I get to Lut Gholein, I'm going to find the largest bowl of Narlant weed and smoke 'til all earthly sense has left my body.",
        "Akara and Kashya are Sisters in the Order of the Sightless Eye, but they are worlds apart. Akara is a slow river of magic, and Kashya, a viper of war.  They're both deeply devoted to their religious order, yet the corruption of their Sisters pains them both to no end.",
        "Charsi is a fine girl..., but she has no business savvy! I know she means well, but the prices she charges for weapons and armor will never earn her a profit.",
        "As long as I keep filling her mind with stories of adventure, she'll never catch on to the fact that I'm raking in gold hand over fist!",
        "That old coot, Cain, is as crazy as a wet Quill Rat. I hear he survived whatever happened in Tristram. Personally, I wouldn't trust a thing he has to say.",
        "Warriv was kind enough to let me travel with his caravan, but don't let him drag you into a search for a new Eastern trade route.",
        "I'm making a fortune right here... from the Rogues, of course! You, on the other hand, always get my best prices!",
        "Don't think you can fool me, Necromancer. I've seen what your kind can do. If you're involved in any of the evil out there, I don't even want to know. Trade quickly and be about your business!"
    ]
  }
}
