{
	"cain" : {
		"name" : "Deckard Cain",
		"quotes" : [
			"Good afternoon.",
			"Good day.",
			"Good evening.",
			"Good morning.",
			"Good to see you!",
			"Greetings.",
			"Hello.",
			"I have a quest for you.",
			"I have a reward for you!",
			"I have news for you.",
			"Stay a while and listen.",
			"Yes?",
			"You have returned!",
			"...I thank you, friend, for coming to my aid.",
			"Oh... Blessings on the Rogues! They finally rescued me from that cursed place!",
			"Regrettably, I could do nothing to prevent the disaster which devastated Tristram. It would appear that our greatest fears have come to pass. Diablo, the Lord of Terror, has once again been set loose upon the world!",
			"As you know, some time ago Diablo was slain beneath Tristram. And when our hero emerged triumphant from the labyrinth beneath town, we held a grand celebration that lasted several days.",
			"Yet, as the weeks passed, our hero became increasingly aloof. He kept his distance from the rest of the townsfolk and seemed to lapse into a dark, brooding depression. I thought that perhaps his ordeal had been so disturbing that he simply could not put it out of his mind.",
			"The hero seemed more tormented every passing day. I remember he awoke many times -- screaming in the night -- always something about 'the East'.",
			"One day, he simply left. And shortly thereafter Tristram was attacked by legions of foul demons. Many were slain, and the demons left me to die in that cursed cage.",
			"I believe now that Tristram's hero was that Dark Wanderer who passed this way before the Monastery fell.",
			"I fear even worse, my friend... I fear that Diablo has taken possession of the hero who sought to slay him. If true, Diablo will become more powerful than ever before.",
			"You must stop him or all will be lost.",
			"That tower marks a place of danger. There is an epic poem about it... How much sorrow one can stand was tested there.",
			"Quickly in and quickly out is all the advice I can give you.",
			"Well done, my friend. Courage and opportunity together have created in you a kind of alchemy.",
			"The Malus was forged and enchanted by the ancient Horadric Mages during the Sin Wars. When their union dissolved, the Malus was entrusted to the Sisterhood guarding the pass into the East.",
			"The Malus has eluded you so far. Well, search thoroughly in the Barracks... That is where the Rogues kept their forge.",
			"The magical effects imbued by the Malus are impossible to predict, but are always to the good.",
			"It is certain that we face the demon queen, Andariel, who has corrupted the Rogue Sisterhood and defiled their ancestral Monastery. This does not bode well for us, my friend.",
			"Ancient Horadric texts record that Andariel and the other Lesser Evils once overthrew the three Prime Evils -- Diablo, Mephisto and Baal -- banishing them from Hell to our world. Here, they caused mankind untold anguish and suffering before they were finally bound within the Soulstones.",
			"Andariel's presence here could mean that the forces of Hell are once again aligned behind Diablo and his Brothers. If this is true, then I fear for us all.",
			"You must kill her before the Monastery becomes a permanent outpost of Hell and the way east lost forever.",
			"Diablo is heading east for some foul purpose. And the only passage east is through the Monastery gate. Obviously, Diablo summoned Andariel to block any pursuit.",
			"For her part Andariel hopes to win Diablo's favor... the lesser demons are always vying for positions of power within the unholy hierarchy!",
			"It is clear that Andariel is acting on behalf of Diablo to prevent anyone from following him eastward. Her defeat would allow you to continue the pursuit.",
			"Ancient lore has it that while Andariel was spawned in the Burning Hells, she is not fond of fire.",
			"This is a great victory indeed, but many more battles await. I will accompany you on your journey, lending what assistance I can...",
			"Remember... Diablo is still out there, seeking something in the desert. I'm afraid that this nightmare will not end until you find what it is that he seeks.",
			"Long ago, the Soulstones were given to the Horadrim by the Archangel Tyrael. They were used to bind the three Prime Evils. I now know that even these holy artifacts were no match for Diablo's power.",
			"I hope that his two brothers are more securely held... but I fear the worst.",
			"It takes time to master your skills... and use will hone your technique. But take care to choose your new skills wisely.",
			"You may recover some mysterious things from the demons you kill. Some of great use to you... some of great peril! Bring them to me and I'll reveal their secrets.",
			"Have I told you about the Horadrim? They were an ancient confederation of mage-clans who sought to bind the three Prime Evils for eternity. The Horadrim are now nearly forgotten... and it appears that the bonds they wove are unravelling!",
			"As the last of the Horadrim, I pray that I can help you remedy their failure.",
			"Long ago, Diablo and his brothers were cast out of Hell by the Lesser Evils. It seems that Hell's balance has shifted, as Andariel is now aligned with the Lord of Terror. Her presence here in the mortal realm does not bode well for us.",
			"The Horadrim used to mummify their highest mages, and infuse them with spells that would allow them to protect their tombs, even after death.",
			"I have no idea why one of them would be acting so malevolently. Perhaps Drognan or Fara would know more about this.",
			"The Horadric mummies were created to protect the tombs, but Radament is far from his burial chamber. Given the aberrations that have been witnessed lately, it comes as no surprise that even the ancient guardian spells have begun to unravel. Be wary of this as you venture farther into the desert.",
			"If you haven't already, tell Atma that Radament is dead. It may help to ease the weight of her mourning.",
			"Ahh... The lost Horadric Scroll! What a fortunate turn of events...",
			"As the last living Horadrim, I alone have knowledge of its meaning. Now, to read the Horadric runes it bears. Hmmm...",
			"The Horadric Mages, after binding Baal within Tal Rasha, magically sealed off his Burial Chamber from the mortal realm. Those same Mages also crafted fearsome Horadric Staves and imbued them with the special power to open the Chamber's hidden door.",
			"After nearly losing one to the thievery of a rogue sorcerer, they divided all the Horadric Staves into two parts - wooden shaft and metal headpiece - hiding them separately to safeguard them.",
			"The Horadrim foresaw our current plight and designed the hiding places to reveal themselves to worthy heroes like you.",
			"Collect both parts of a Horadric Staff and unite them using a Horadric Cube. Then, you may enter Tal Rasha's Burial Chamber.",
			"You have quite a treasure there in that Horadric Cube. According to Horadric lore, the Cube can restore a Horadric Staff.",
			"To do it - use the Cube as you would a scroll. When the Cube opens, place both pieces of the Staff into it and use the Cube's transmute power.",
			"You'll be pleased to know that the Cube has other alchemical uses as well...",
			"Six gems plus one sword transmute into a socketed long sword.",
			"You may also transmute two quivers of crossbow bolts into one quiver of arrows, while two quivers of arrows yield one quiver of bolts.",
			"I must leave it to you to discover other formulae.",
			"The Staff of Kings! You astound me, my friend. You have discovered the shaft portion of a Horadric Staff.",
			"I trust you know how to use a Horadric Cube to unite the shaft with its headpiece.",
			"The Viper Amulet you bear is actually the headpiece of a Horadric Staff!",
			"Yes... You have an uncanny knack for finding rare and valuable artifacts. Of course, you'll have to use a Horadric Cube to combine the headpiece with the shaft.",
			"Excellent! You have a Horadric Staff.",
			"Carry it with you into Tal Rasha's Tomb. Find within the Tomb the chamber whose floor is inset with the Circle of Seven Symbols.",
			"Place the Staff into the receptacle you find there. That will open the secret passage into Tal Rasha's Burial Chamber.",
			"But, be prepared for a fight - you'll likely have to kill Tal Rasha to destroy Baal.",
			"Drognan may have some advice on this matter. Hmm... I think I'll speak with him myself.",
			"The source of this spell is probably a magical altar. It will not be enough to kill the Claw Vipers. To reverse the spell you must destroy the altar.",
			"I've been speaking with Lord Jerhyn, and I sense that he is becoming more and more agitated by something. You should try to talk to him again.",
			"If he still won't take you into his confidence, seek to prove yourself a bit more. I gather that his respect for you is growing.",
			"I very much doubt that Horazon still lives in his Sanctuary. He possessed great power and influence over demons, but even that may not have been enough in the end. One of his notoriety cannot easily remove himself from the vengeful reach of Hell.",
			"I've been thinking about the problems in Jerhyn's palace. Perhaps this has occurred to you as well...",
			"If those cellar passageways lead to the Arcane Sanctuary, then that is where the demons came from. Horazon's haven must have been breached!",
			"You must move quickly now, friend, for Diablo is undoubtedly close to finding what he seeks. Find the Tomb of Tal Rasha before he frees the Lord of Destruction.",
			"The appearance of the mage you describe sounds like one I met back in Tristram. Many Vizjerei came to fight against Diablo, the Lord of Terror. Perhaps, this is one of them.",
			"You know, fate seems to have frowned upon all of the heroes who confronted that terrible Evil. Take care or the same may happen to you.",
			"I hope that this false Summoner found peace in death. Unfortunately, it is more likely that he will be dragged down into Hell by the demons he was bound to.",
			"Let this be a lesson to you... Demonic magic is a quick path, but its powers are seductive and deadly.",
			"Diablo nears his goal. We have little time to lose.",
			"Remember, my friend, that Andariel gave herself willingly to Diablo's cause. It would be prudent to assume that the other Evils will attempt to aid their master as well.",
			"The Archangel Tyrael was the one who gave the Soulstones to the Horadrim two hundred and sixty years ago.",
			"It is highly unusual for the forces of Heaven to so directly interfere with man's destiny, but Tyrael was said to act of his own volition. We have never been able to discern why.",
			"Perhaps, he goes against the consensus of Heaven because he doubts our ability to defend ourselves, or perhaps, he sees more threat than his peers.",
			"Where the actions of Hell often seem straightforwardly bent on destruction, the motives of Heaven are unfathomable.",
			"Now make haste... Both Diablo and Baal must be stopped before they join with their brother, Mephisto. If the three Prime Evils unite once again, the world as we know it will be no more.",
			"Elzix is quite a scoundrel, but I like him all the same.",
			"There is something about Fara that troubles me. Her manner is strange for a lonely desert-maid.",
			"Greetings, my friend. Have you spoken to Jerhyn yet? He's quite a remarkable leader for being such a young man. Then again, the old blood has always run strong in this land.",
			"Meshif is an interesting man. Part of him longs for the freedom of the open seas... Yet his heart belongs in his homeland.",
			"I talked at length with Warriv as we crossed the desert from Khanduras. He has many fascinating tales of the dangers in the desert. His experience may be useful to you.",
			"I've not set foot in glorious Kurast for many years. But I never would have imagined it could be so corrupted.",
			"Certainly, this must be Mephisto's work! You'd best get going, my friend. Diablo and Baal are still out there and you must find them.",
			"Back in Lut Gholein Meshif told me he had a fondness for jade figurines. On his trading voyages he collected an odd assortment of such small statues.",
			"I would show him your figurine.",
			"I've read legends about a sage named Ku Y'leh, who studied the mysteries of life beyond death.",
			"If I remember correctly, his ashes were ensconced within a golden statuette. It was a very strange tale.",
			"So, Meshif had the Golden Bird all along. I wonder if he knows what he gave up for that jade figurine.",
			"I've done some research on the Taan mage-clan, and it seems that most of their magical studies were focused on Skatsimi rites.",
			"If anyone is qualified to use the powers of the Gidbinn, it would be Ormus.",
			"Since you haven't come across the Gidbinn yet, the dagger must be deeper in the jungle nearer Kurast.",
			"Who could have foreseen that the Old Religion would play such an effective role in our war against the Three? Again, your efforts amaze me, my friend.",
			"Never forget that your ultimate purpose here in Kurast is to destroy Mephisto. The ancient Horadrim imprisoned the Lord of Hatred inside the Guardian Tower that is located within the Temple City of Travincal.",
			"Know this, friend. The only way to gain entry to Mephisto's prison is to destroy the artifact known as the Compelling Orb.",
			"Mephisto used this device to control the Zakarum Priests and their followers. The Orb can only be destroyed with an ancient flail imbued with the spirit of the one incorruptible priest.",
			"Soon after his imprisonment, Mephisto worked his evil corruption on the Zakarum priesthood. All were turned to his dark ways, save one - Khalim, the Que-Hegan of the High Council.",
			"Mephisto directed the other Council priests to slay and dismember Khalim and then scatter his remains across the Kingdom. The Priest Sankekur succeeded Khalim as Que-Hegan, eventually becoming the embodiment of Mephisto here on the mortal plane.",
			"The corrupted High Council fashioned an Orb to control the rest of the Zakarum faithful and used their powers to hide the lair of their master from mortals.",
			"Your task is to collect the scattered relics of Khalim - his Heart, his Brain, and his Eye. Then, using the Horadric Cube, transmute Khalim's Flail with his relics.",
			"Once this is accomplished, you must destroy the Compelling Orb with Khalim's Will to open the way into the corrupt sanctum of Mephisto.",
			"Ahh... Khalim's Eye! Only it can reveal the true path to Mephisto.",
			"Place the Eye in the Horadric Cube along with Khalim's other relics - the Heart, the Brain, and the Flail.",
			"This is most fortunate! Khalim's Brain knows Mephisto's weakness.",
			"Place it in the Horadric Cube along with Khalim's other relics - the Eye, the Heart, and the Flail.",
			"You have found Khalim's Heart, and it still bears the courage to face Mephisto!",
			"Place it in the Horadric Cube along with Khalim's other relics - the Eye, the Brain, and the Flail.",
			"Once properly imbued, Khalim's Flail can destroy the Compelling Orb and reveal the way to Mephisto.",
			"Place it into the Horadric Cube along with Khalim's relics - his Heart, his Brain, and his Eye. Then, transmute them to carry out Khalim's Will.",
			"Masterfully done, hero! You have crafted Khalim's Will. Employ it to destroy the Compelling Orb and open the way to Mephisto.",
			"May the true Light guide your way.",
			"The Black Book is a powerful source of information. The Zakarum will do everything in their power to stop you from obtaining it.",
			"I heard that there are ruined temples in Kurast. Perhaps you will find the Black Book in one of them.",
			"You have found a source of information powerful enough to turn the tide against the Zakarum.",
			"Ormus tells me that the Council is comprised of tremendously powerful priests. It will be difficult to best them.",
			"The Temple City is well guarded. You'd best keep your wits about you.",
			"Sankekur may be using a Compelling Orb to control the minds of the Children of Zakarum.",
			"Ridding Kurast of the Council of Zakarum was essential. Still, there is more you must do. The Compelling Orb, too, must be destroyed.",
			"Diablo and Baal must be close to finding their brother, Mephisto, by now. You've no time to waste.",
			"You must reach Mephisto before his brothers do.",
			"The ancient Horadrim always feared that the Three would escape their prisons and unite. I can't believe that I, the last of their Order, have seen it come to pass.",
			"You are the only one who can prevent this, my friend. The final hour draws near.",
			"Search the Tower thoroughly. Mephisto must not escape.",
			"Our faith in you was well deserved. But Diablo has made his way to Hell; and it is likely that Baal followed him there.",
			"Enter the Infernal Gate and kill the Lord of Terror before all is lost. Only then will our world be saved!",
			"Asheara seems like a very tough woman. I'd be careful around her if I were you.",
			"Drognan told me of Hratli when we were in Lut Gholein. He said that he weaves magic into his forge and produces mystical weapons and armor.",
			"His skills could be quite useful to you.",
			"Seeing his homeland in such a state must be horrifying to Meshif. I'm surprised he's willing to remain here in order to help you.",
			"Have you met, Natalya? She appears to be a member of the Khral-Harzhek, a secret order that has been around for centuries... almost as long as the Horadrim, itself.",
			"Her presence here makes me uneasy, for they are traditionally sworn to hunt down Magi who have betrayed the trust of their order.",
			"I wonder why she is here.",
			"Judging from his dress and strange markings, I would guess that Ormus is from the ancient Taan mage-clan. Yet none of the others here seem to know that he is a sorcerer.",
			"The Taan were once as powerful as the Vizjerei clan, but their studies were even more secretive. I wonder what he's hiding.",
			"Ormus would like you to think him mad. Better to watch his actions than listen to his words.",
			"Hello, my friend. I was hoping you'd return. It gets very unnerving here...especially when I'm alone.",
			"Can you believe this place? Did you ever dare to dream that you'd one day stand upon the crossroads between Heaven and Hell? This Pandemonium Fortress is truly miraculous.",
			"However, your journey is not yet over. Diablo still roams free in Hell, marshalling his demonic forces. Only when he is beaten will our world finally have peace.",
			"Hurry now... the sands of time slow for no one!",
			"Tyrael has asked you to confront Izual the Fallen? He must have great faith in your abilities!",
			"I trust you know what you're doing... Be careful. You're our last hope.",
			"Having trouble finding the Fallen Angel, eh?",
			"You'd better hurry. It's beginning to feel like some great evil is permeating the air around here.",
			"You're lucky to be alive, my friend! It is imperative that you find and stop Diablo!",
			"You should speak of this with Tyrael. He will know what to make of this.",
			"The time has come for you to destroy Mephisto's Soulstone!",
			"Take the Stone to the Hellforge. Place it upon the forge and strike it soundly with the Hammer.",
			"Only by doing this can you prevent Mephisto from manifesting in this world ever again.",
			"The time has come to destroy Mephisto's Soulstone!",
			"Although I picked it up before entering the Infernal Gate, I believe you should carry out this crucial mission.",
			"Take the Stone to the Hellforge. Place it upon the forge and strike it soundly with the Hammer.",
			"Only by doing this can you prevent Mephisto from manifesting in this world ever again.",
			"Congratulations, hero!",
			"Surely, even Diablo, himself, sensed the fury unleashed when you smashed his Brother's Soulstone.",
			"You don't have time to dally about here!",
			"Diablo awaits you in Hell. Remember... Diablo's greatest weapon against you is Terror.",
			"Don't give in to your fears. Resist his power and put an end to him for good!",
			"I knew there was great potential in you, my friend. You've done a fantastic job.",
			"Though my ancestors often struggled against the Three Evils and their minions, I've always lived a shut-in, scholarly life. I'm glad that my wisdom aided you.",
			"Now, I wish to leave this place. Though Heaven's Gates are a marvel to behold, I hope I won't have to see them again for many, many years.",
			"Please talk to Tyrael about leaving this place now!",
			"I have read much about the enigmatic Archangel Tyrael. He was revered in Horadrim lore both for his compassion for mortals and his unquenchable spirit.",
			"It was rumored that he went against the wishes of Heaven and gave the Horadrim the original Soulstones in order to trap Diablo and his Brothers.",
			"I am amazed to find this place so untouched. Everything else in the path of Baal the Lord of Destruction lies in ruin.",
			"These Barbarians must indeed be the legendary guardians of Mount Arreat. They are a proud, hardy people. Don't expect to be greeted warmly -- strangers here rarely are.",
			"Perhaps I can gain their trust. I'll spend some time with the townsfolk and try to understand them better. I'll let you know what I discover.",
			"I believe that stopping the siege on Harrogath is the only way for you to earn the trust of these people.",
			"I understand your reluctance, but now is the time to strike.",
			"Those catapults were like nothing I have ever seen before. You have prevailed against Shenk, my friend, but Baal is still far ahead of you.",
			"I know firsthand that captivity is a sad fate for a man. Find them quickly.",
			"If you are having trouble finding Qual-Kehk's soldiers, you should talk to Malah. She healed those who made it back before. Perhaps she would have some advice.",
			"You've become a hero to this town, my friend. The shadows have lifted ever since you brought the Light to Harrogath.",
			"I would listen to Malah. Nihlathak speaks with a venomous tongue and acts as if the entire weight of this town rests upon his shoulders.",
			"Perhaps there is more going on here than we know.",
			"Nihlathak's story does sound reasonable, considering what I've heard about Anya. However, the best lies are often hidden within truth.",
			"Goodness! Anya frozen by that fallen Barbarian, Nihlathak...Perhaps Malah can help you where I cannot.",
			"For one so young, Anya commands great respect. Now that she is here, I will make it a point to talk to her about Mount Arreat.",
			"You should do the same.",
			"Regretfully, I know very little about this Relic. However, if what the others say is true, then Baal must not gain possession of it.",
			"Stop Nihlathak...before all is lost.",
			"Ohh...This is a truly horrible turn of events.",
			"I know it seems you have always been one step behind, my friend. But look at it this way...You have evil on the run.",
			"Beware! Baal grows stronger with every passing moment.",
			"A test of mettle is a fitting rite of passage for a Barbarian hero.",
			"We have come too far to be defeated now, my friend. I have seen you complete many difficult quests. Though this may be your greatest trial, it is not beyond your reach.",
			"You have proven yourself to these people. They look to you as their warrior, their champion.",
			"Remember this. Baal once possessed Tal Rasha, one of the most powerful of the ancient Horadrim.",
			"Your battles with Mephisto and Diablo will pale in comparison to your battle with Baal.",
			"The Lord of Destruction aided by Tal Rasha's knowledge...The mountain itself will tremble when you clash.",
			"I knew in time you would defeat Baal. You have done everything you set out to do, my friend.",
			"Ever since you rescued me from Tristram, I have believed in you. It has been a supreme honor to aid you along the way.",
			"So...The Worldstone was corrupted by Baal. And now Tyrael must destroy it. Worry not. Through whatever lies ahead I have faith that the Light will guide us both.",
			"Go, now, back to the Worldstone chamber, and enter the portal Tyrael has opened for you.",
			"With hellspawn, size is no measure of their threat. Demons half the size of men can kill with a gesture, while hellish pack animals trample any who stand in their way.",
			"Though these Barbarians are known throughout the kingdoms as ferocious fighters, they are also capable of great compassion.",
			"They have trained throughout history for a battle their legends foretell will decide the fate of the world.",
			"The angel Tyrael has watched over the guardians of Arreat throughout history. I do not believe that Baal and Tyrael have come to fight over a paltry few souls.",
			"They are here to settle a conflict as old as time itself.",
			"During my time with the Horadrim, we often debated the nature of Mount Arreat.",
			"We knew that the Barbarian clans zealously guarded the mountain as their sacred duty. However, many dismissed their zeal as simple superstition...combined with an inborn hostility toward outsiders.",
			"Those Horadrim who trekked up Arreat were never heard from again...Still, I do not believe they died at the hands of Barbarians.",
			"All users of the magical arts know of Mount Arreat, but few understand its true nature. It is the nexus of an unfathomable magic.",
			"It bodes ill that the Lord of Destruction races to its summit with such purpose. I fear for the whole world should Baal gain what he seeks.",
			"I have spent decades trying to understand the forces at work in this world. But in the face of all that is transpiring, I realize how meager my knowledge is.",
			"I will be of assistance where I can, my friend.",
			"Though the Elder Council of Harrogath is gone, there are many capable young leaders to take their place.",
			"Anya certainly has enough courage and intelligence to lead them all, if they can survive this catastrophe.",
			"It is my belief that the Soulstones are at the center of this conflict. If only that fool Marius had not intervened, Baal would still be imprisoned within Tal Rasha.",
			"Ah, Anya. Such a fine example of feminine strength...",
			"She reminds me of the Zakarum priestesses I knew in my youth. They don't take vows of chastity, you know.",
			"It is fortunate that this town has such a talented smith.",
			"The quality of Larzuk's work surely complements your skills. In fact, he would have been quite welcome amongst the Horadrim.",
		"While you are venturing deeper into the Labyrinth you may find tomes of great knowledge hidden there.",
		"Read them carefully for they can tell you things that even I cannot.",
		"I know of many myths and legends that may contain answers to questions that may arise in your journeys into the Labyrinth",
		"If you come across challenges and questions to which you seek knowledge, seek me out and I will tell you what I can.",
		"Griswold - a man of great action and great courage. I bet he never told you about the time he went into the Labyrinth to save Wirt, did he",
		"He knows his fair share of the dangers to be found there, but then again - so do you. He is a skilled craftsman, and if he claims to be able to help you in any way, you can count on his honesty and his skill.",
		"Ogden has owned and run the Rising Sun Inn and Tavern for almost four years now. He purchased it just a few short months before everything here went to hell",
		"He and his wife Garda do not have the money to leave as they invested all they had in making a life for themselves here. He is a good man with a deep sense of responsibility.",
		"Poor Farnham. He is a disquieting reminder of the doomed assembly that entered into the Cathedral with Lazarus on that dark day",
		"He escaped with his life, but his courage and much of his sanity were left in some dark pit. He finds comfort only at the bottom of his tankard nowadays, but there are occasional bits of truth buried within his constant ramblings.",
		"The witch, Adria, is an anomaly here in Tristram. She arrived shortly after the Cathedral was desecrated while most everyone else was fleeing",
		"She had a small hut constructed at the edge of town, seemingly overnight, and has access to many strange and arcane artifacts and tomes of knowledge that even I have never seen before.",
		"The story of Wirt is a frightening and tragic one. He was taken from the arms of his mother and dragged into the labyrinth by the small, foul demons that wield wicked spears. There were many other children taken that day, including the son of King Leoric. The Knights of the palace went below, but never returned. The Blacksmith found the boy, but only after the foul beasts had begun to torture him for their sadistic pleasures.",
		"Ah, Pepin. I count him as a true friend - perhaps the closest I have here. He is a bit addled at times, but never a more caring or considerate soul has existed. His knowledge and skills are equaled by few, and his door is always open.",
		"Gillian is a fine woman. Much adored for her high spirits and her quick laugh, she holds a special place in my heart. She stays on at the tavern to support her elderly grandmother who is too sick to travel. I sometimes fear for her safety, but I know that any man in the village would rather die than see her harmed."]
	},

	"tyrael" : {
		"name" : "Tyrael",
		"quotes" : [
			"I thank you, mortal, for my freedom. But I did expect you earlier.",
			"I am the Archangel Tyrael. I came here to prevent Diablo from freeing his brother, Baal. But I have failed. Now, Terror and Destruction roam free throughout your world.",
			"Even now, they head towards the Eastern capital of Kurast - to the very heart of the Zakarum Temple. There they hope to find their eldest brother, Mephisto, the Lord of Hatred who was imprisoned there ages ago.",
			"If the three Prime Evils unite, they will be invincible. Though it is unclear as to what their aims are, it is certain that they must be stopped at all costs.",
			"I am broken and the energies that tie me to this world are diminishing rapidly.",
			"You must take up this quest and prevent the Three Brothers from reuniting. You must cross the sea and search for Diablo and Baal in Kurast.",
			"Now hurry, mortal... Time is running out for all of us!",
			"Farewell.",
			"Godspeed.",
			"Goodbye.",
			"Good to see you.",
			"Good to see you again.",
			"Greetings.",
			"Greetings, mortal. I knew you'd find your way back here.",
			"Hail to you, champion.",
			"Hello.",
			"I need your help.",
			"Thank you.",
			"Welcome, avenger.",
			"What can I do for you?",
			"What do you need?",
			"Yes?",
			"Your presence honors me.",
			"It is good to see you again, hero.",
			"Mephisto's defeat is a great victory for the Light. I knew that you would eventually find your way here. The Pandemonium Fortress is the last bastion of Heaven's power before the Gates of the Burning Hells.",
			"This place has been hallowed by the blood of thousands of champions of the Light, many of whom were mortal, like yourself. Now the final battle against the Prime Evils draws near... and you must face it alone.",
			"I have been forbidden to aid you directly, save for a few bits of wisdom. For this is the hour of mortal Man's triumph...your triumph.",
			"May the Light protect you and the powers of Heaven shine upon your path...",
			"There is a dark, tortured soul who was trapped within this forsaken realm long ago. He was called Izual by mortal men, and in ages past he was my most trusted Lieutenant.",
			"Yet, against my wishes he led an ill-fated assault upon the fiery Hellforge, itself.",
			"Despite his valor and strength, Izual was captured by the Prime Evils and twisted by their perverse power. They forced him to betray his own kind and give up Heaven's most guarded secrets.",
			"He became a corrupt shadow of his former self - a fallen angel trusted neither by Heaven nor Hell.",
			"For his transgressions, Izual's spirit was bound within the form of a terrible creature which was summoned from the Abyss. His maddened spirit has resided within that tortured husk for many ages now.",
			"It seems to me that he has suffered long enough. I implore you, hero, find Izual and release him from his cruel imprisonment.",
			"Put an end to his guilt and suffering.",
			"Though Izual no longer carries the Angelic Runeblade, Azurewrath, he may still possess great strength and power within his new form.",
			"Also, he may not be able to tell friend from foe while in his present state. If you find him, he will almost certainly be hostile.",
			"Proceed with the utmost caution.",
			"You mustn't delay, mortal hero. Izual must be put to rest, but Diablo still lurks within this realm.",
			"Go now... Hurry!",
			"Thank you, hero, for putting Izual's tortured spirit to rest. May the Light protect you and the powers of Heaven shine upon your path.",
			"But, if what you tell me is true, then I fear that we have been played for fools all along.",
			"Izual helped Diablo and his Brothers trick me into using the Soulstones against them... Now the Stones' powers are corrupted.",
			"With the combined powers of the Soulstones under their control, the Prime Evils will be able to turn the mortal world into a permanent outpost of Hell!",
			"The time has come to hunt down and destroy Diablo, himself.",
			"But beware, the Lord of Terror is not to be underestimated. He single-handedly destroyed the town of Tristram and corrupted the last noble hero who tried to stop him.",
			"This time, you must defeat him for good. Only by destroying the Soulstone which he carries will his spirit be banished forever.",
			"Good luck! Though this be our darkest hour, it may yet be your greatest moment.",
			"Praise be to the Light! You have accomplished the impossible!",
			"Diablo and Mephisto have been banished back into the Black Abyss that spawned them and the corrupted Soulstones are no more.",
			"You've done well, hero. For now, you should rejoice.",
			"However, while you were fighting here, Baal remained behind in the mortal realm, building an army of hellish minions. Now, Baal's army is searching for the Worldstone, the ancient source of all the Soulstones and their power, while leaving behind a wake of destruction. They have forged deeply into the Barbarian homelands, heading directly for the summit of Mount Arreat!",
			"Baal knows, mortal hero! That is the very site of the blessed Worldstone!",
			"Now, enter the portal I have opened for you. It will take you to the Barbarian city of Harrogath, the last bastion of Order on the slopes of Arreat.",
			"Long ago, I swore an oath to watch over the Horadrim and their descendants.",
			"As Deckard Cain is the last of their esteemed Order, I will not allow him to perish here so far from the lands of his birth.",
			"Be at ease, hero, I know that he is your friend. He shall come to no harm.",
			"I am impressed, mortal. You have overcome the greatest challenge this world has ever faced and defeated the last of the Prime Evils. However, we are too late to save the Worldstone. Baal's destructive touch has corrupted it completely. ",
			"Given enough time, the Worldstone's energies will drain away and the barriers between the worlds will shatter -- the powers of Hell will flood into this...Sanctuary...and eradicate your people and everything you've labored to build. ",
			"Therefore, I must destroy the corrupted Worldstone before the powers of Hell take root. This act will change your world forever -- with consequences even I cannot foresee. However, it is the only way to ensure mankind's survival. ",
			"Go now, mortal. I have opened a portal that will lead you to safety. ",
			"May the Eternal Light shine upon you and your descendants for what you've done this day. The continued survival of mankind is your legacy! Above all else, you have earned a rest from this endless battle.",
			"Hope remains within the hearts of men."
		]
	},
	"diablo" : {
		"name" : "Diablo",
		"quotes" : [
				"Aggh... The smell of life surrounds me.",
				"Not even death can save you from me..."
		]
	},
	"izual" : {
		"name" : "Izual",
		"quotes" : [
				"Save yourself!",
				"Leave me!",
				"You cannot help me!"
		]
	},
	"andariel" : {
		"name" : "Andariel",
		"quotes" : [
				"Die, maggot.",
				"Fear me!",
				"The East is beyond your grasp."
		]
	},
	"mephisto" : {
		"name" : "Mephisto",
		"quotes" : [
				"My brothers have escaped you.",
				"You're too late, ha ha ha ha ha ha."
		]
	},
	"baal" : {
		"name" : "Baal",
		"quotes" : [
				"My brothers will not have died in vain!",
				"Aaaaggghhh...",
				"(Maniacal Laughter)."
		]
	},
	"atma" : {
		"name" : "Atma",
		"quotes" : [
				"Farewell.",
				"Goodbye.",
				"Good day.",
				"Good evening.",
				"Good morning.",
				"Greetings.",
				"Greetings, hero.",
				"Hello.",
				"Hello again. Things have been very quiet around here since you left.",
				"I need you help.",
				"Return, anytime.",
				"Tell me your troubles.",
				"There's no trouble a mug can't cure.",
				"Yes?",
				"You'll forgive me if I seem upset. I've suffered a loss recently, but that's not your problem.",
				"It's a relief to see some proper warriors come through here. My name is Atma. I run the tavern here in Lut Gholein.",
				"I don't expect this of you, but if you want to help me, I would be grateful.",
				"In the sewers below our city, there lurks a horrid creature that hungers for human flesh. The creature has killed many, including my son and my husband.",
				"If you destroy it, I will reward you. Please be careful though, that beast has taken enough from us already.",
				"The sewer entrance is through the trap door just up the street.",
				"The creature makes its lair in the tunnels beneath this city. He butchered my husband and son... I simply cannot bear to talk about it...",
				"I am starting to have second thoughts about my request... I couldn't bear the thought of you losing your life on my behalf.",
				"Please be careful.",
				"They say that the taste of vengeance is bittersweet, but I find it to my liking.",
				"In addition to my undying gratitude, I have spoken on your behalf with the rest of the townspeople. The merchants have agreed to show their gratitude by offering their wares and services at lower rates.",
				"Oh... Jerhyn wants to see you, too. You'll find him in front of the palace.",
				"Drognan, the wizard, will have some idea as to what is happening.",
				"I was going to go to bed, but then I realized that I have no idea what time it is. It could be the crack of dawn, for all I know.",
				"You have done well to restore light to our world.",
				"Arcane Sanctuary? That place sounds awful! Even if you find a way into it, what makes you think you'll be able to leave again?",
				"So you've been in the palace, have you? Tell me, why does Jerhyn keep that place locked up so tight?",
				"Oh, those poor women! Will the slaughter never end? Thank you once again for protecting our city.",
				"You always seem to find the worst trouble. I don't know how you handle it.",
				"You're more the hero than I could have dreamed. Perhaps, there is hope for us after all.",
				"I've heard legends of the Tomb of Tal Rasha, but I thought they were just old tales meant to scare young children.",
				"You have proven to be the greatest of heroes, and I am honored to call you friend. Thank you for bringing peace to our lives again.",
				"Evil has laid siege to Lut Gholein and you may be our last hope...",
				"This public house used to be quite lively, until this plague of evil. Luckily, I've managed to save away a tidy nest egg. Unfortunately, I couldn't save everything I cared for...",
				"In addition to my public house, there used to be several brothels doing business here. When the troubles first started in the desert, the harem guilds sought sanctuary within the palace.",
				"Of course, Jerhyn was glad to oblige. I'll bet they're finding many ways to repay him for his protection.",
				"Drognan is a very private person. He's always studying ancient scrolls and such. He may be a mystery to me forever.",
				"Elzix and I have reached an understanding over the years. He sends travelers to me for drink and entertainment, and I send them back to him for a soft bed. The travelers often trade their wares for lodging.",
				"Geglash may seem like a sot, but he's a brave man. All this trouble has driven him to drinking more than his usual.",
				"Oh, Lysander is cranky, but he's a good old man. He used to give me medicines when... my son was ill.",
				"Meshif seldom patronizes my establishment. I think he prefers to stay out there on his leaky ship."
		]
	},
	"akara" : {
		"name" : "Akara",
		"quotes" : [
			"Greetings, young Sorceress. It is good to see more of your kind at work in the world these dark days. In my opinion, the world needs more women to fight against the great shadow. But I am forgetting my manners...",
			"I am Akara, High Priestess of the Sisterhood of the Sightless Eye. I welcome you, traveler, to our camp, but I'm afraid I can offer you but poor shelter within these rickety walls.",
			"You see, our ancient Sisterhood has fallen under a strange curse. The mighty Citadel from which we have guarded the gates to the East for generations, has been corrupted by the evil Demoness, Andariel.",
			"I still can't believe it... but she turned many of our sister Rogues against us and drove us from our ancestral home. Now the last defenders of the Sisterhood are either dead or scattered throughout the wilderness.",
			"I implore you, stranger: please help us. Find a way to lift this terrible curse and we will pledge our loyalty to you for all time.",
			"I understand that Cain is the last descendant of the ancient Horadrim and that his knowledge of their lore is vast. He could prove to be very useful in discerning the nature of our current crisis.",
			"Kashya has always been fiercely loyal, but I fear her anger and frustration over these recent events will lead her into harm's way. She is highly protective of the few Rogues remaining under her command and will not send them into combat unless there is dire need.",
			"Charsi is young and innocent. However, I believe her Barbarian blood thrills to the prospect of adventure and danger. She takes great pride in her work and finds comfort in the fact that her weapons and armor are helping to end this evil plague.",
			"Though he has only been our guest for a short time, I sense that Warriv has faced many harrowing trials. Though he knows, as I do, that a terrible evil has blanketed the land, his only real concern is to reach the eastern trading ports with his caravan.",
			"To be honest, I have done my best to stay clear of Gheed. He wears dishonesty about himself like a cloak and seeks only to better his situation by preying on the misfortunes of others.",
			"The wilderness is overrun with Evil and the minions of Hell have taken our rightful home. We must purge all Evil from the Monastery and restore order to the world.",
			"I often dream of the day we reclaim our own. The Sightless Eye sees through the mist of time a great glory ahead, but how far ahead the Eye cannot discern.",
			"Our mental discipline is matched only by our skill in archery... I only hope these are enough to withstand this awful trial.",
			"Beware that you do not suffer the fate of the corrupted Rogues. To lose one's life is a tragedy, but to lose one's soul is even worse.",
			"Even though the corrupted ones were once of our Order, you need not shy from slaying them, for they stand between you and Andariel. Perhaps, when the Demon Queen is dead, our Sisters will return to life, but more likely they will be forever bound to their unholy pact.",
			"The Sisterhood of the Sightless Eye has a long and distinguished history. Over the generations our Order has become a deadly fighting force as well as a bastion for women who sought to forge their own destiny.",
			"Yet beware, young one, the lure of power and knowledge can lead to disaster. I have seen ambition foul the bravest of hearts and recklessness dull hard-won wisdom. You would do well to tread lightly upon the dark path you have chosen to explore.",
			"There is a place of great evil in the wilderness. Kashya's Rogue scouts have informed me that a cave nearby is filled with shadowy creatures and horrors from beyond the grave.",
			"I fear that these creatures are massing for an attack against our encampment. If you are sincere about helping us, find the dark labyrinth and destroy the foul beasts. May the Great Eye watch over you.",
			"I should add that many Rogue scouts have died in that horrible place. We cannot afford to lose any more. If you choose to enter that Den of Evil, you must do so alone.",
			"Your task is not complete until you have killed all the demons in that cave.",
			"You have cleansed the Den of Evil. You've earned my trust and may yet restore my faith in humanity. Your reward is training in the skill of your choice.",
			"Blood Raven fought valiantly against Diablo in the catacombs beneath Tristram... She was never quite the same afterwards. It is now obvious she brought an evil influence back with her.",
			"If you fail to destroy Blood Raven, I fear that our Order will perish forever.",
			"Andariel must be made to pay for her sacrilege!",
			"It is clear that we are facing an Evil difficult to comprehend, let alone combat. There is only one Horadrim sage, schooled in the most arcane history and lore, who could advise us... His name is Deckard Cain. You must go to Tristram and find him, my friend. I pray that he still lives.",
			"Tristram is too far to journey by foot... Cain would likely be dead when you arrived. However, there is a magical portal that will take you there instantly.",
			"To open it, one must stand within the circle of Cairn Stones and touch them in a certain order. The proper order can be found in the runes written on the bark of the Tree of Inifuss.",
			"You must find the sacred Tree of Inifuss and bring back its bark. I will translate the runes to unlock the Stones' mystic pattern.",
			"How will you find Cain without going to Tristram? Finding the Tree of Inifuss is the first step on your journey.",
			"Ah, very good. I have translated the runes on this scroll. You must find the Cairn Stones and touch them in the order that I have written.",
			"If he still lives, Deckard Cain may be in grave peril! You must hurry to Tristram before all is lost!",
			"You have risked your life to rescue Cain. For that we thank you. We must seek his counsel immediately.",
			"The dangers there are not solely architectural. Once inside that wretched place, many succumb to a vile miasma.",
			"There is no more I can tell you about that ancient tower.",
			"I thought the stories of treasure in the tower were nothing but lies. I am glad you found something of value in that death-trap. Would that our Sisters had been so fortunate.",
			"You must find the Malus.",
			"If you can't carry out this quest, how will you face the greater evils ahead?",
			"Well done, my friend. But remember, the return of the Horadric Malus is but one step in reclaiming the Monastery.",
			"Andariel has desecrated all we hold dear. She must not be permitted to serve Diablo. Destroy her! Her corruption of our Order must be undone!",
			"You have done much to help us, but I sense that this has only fueled Andariel's fury. She will not stop until we are all dead. You must kill Andariel before her army can gain the upper hand.",
			"Finally, we may rejoice! We owe you a debt we can never repay. I only hope that in time we will be able to rebuild our Order. All our thanks go with you, my friend."
		]
	},
	"gheed" : {
		"name" : "Gheed",
		"quotes" : [
				"Farewell.",
				"Goodbye.",
				"Good day.",
				"Good evening.",
				"Good morning.",
				"Good to see you again. Since the Rogues have been moving back into their monastery, they haven't been buying anything from me!",
				"Greetings.",
				"Hello.",
				"Let's deal, my friend.",
				"May I help you?",
				"I need your help.",
				"What'cha need?",
				"Yes?",
				"Good day to you partner! I'm Gheed and I can already tell that I'll be your best friend in this forsaken camp.",
				"A spare weapon, some gold, a small gem is all I want in exchange for the equipment you'll need on whatever quests you might undertake.",
				"Now, now, now... Don't be shy, all of my items are guaranteed for life and come with a two-day warranty!",
				"A Necromancer! I hoped I'd never have to lay my eyes on one of your kind again. ... The recent troubles in this area have brought out all kinds, I see. Nevertheless, your money's good...",
				"A spare weapon, some gold, a small gem is all I want in exchange for the equipment you'll need on whatever quests you might undertake!",
				"Now, now, now... Don't be shy, all of my items are guaranteed for life and come with a two-day warranty!",
				"You're a brave soul! I'd sooner thrust my sacred scepter into the foulest, carbuncular trull than set one boot into that cave.",
				"Demons still befouling that cave, huh? I think you might need a new weapon.",
				"The only good demon is a dead one, I say.",
				"By the way, did you happen to find anything in that cave you'd like to sell?",
				"I'm sorry... The undead are bad for trade. I have a strict no-return policy.",
				"I wonder if that old gossip, Melra, is among the undead? Oh, she had dirt on everybody.",
				"Some of those gals weren't so nice the first time around.",
				"I would sooner micturate in a tankard of my own ale than journey to Tristram!",
				"Barking up the wrong tree, huh? You'll find it, just keep looking.",
				"Look, friend... I trade a lot of strange items, but I'm not going to start dealing in bark. Okay?",
				"I'm told that Tristram now resembles a mead hall... after a Barbarian wedding! I will wait here for your most glorious return.",
				"Ah, Cain is here... another customer. I haven't been this pleased since a love-starved maiden let down a bit more than her hair.",
				"The only wealth you're likely to find there is a wealth of vermin.",
				"Guess what! I've named a boil on my ass after you. It, too, bothers me every time I sit down.",
				"Warriv's advice is like corpse gas; it befouls the air for a moment and then it disappears.",
				"Charsi talks of nothing anymore, but this Horadric Malus. Between you and her my ears need a rest.",
				"Just find it and bring it back quickly.",
				"I have heard that you bear us no Malus.",
				"I guess it's too late to take back some of the names I called you.",
				"You're going after Andariel?",
				"... One of my wagon wheels is in need of repair. I'll be under the wagon, if I'm needed.",
				"Have you stumbled upon that Demon Queen, yet? I hear she's quite the beauty... as far as Maidens of Anguish go, that is.",
				"I'm going to party like it's 999!",
				"Andariel's demonic forces have taken up residence in the forests as well as the Monastery. Uh-uh. I won't be venturing out of the camp. So, if you need anything, I'll be right here.",
				"When - or if - I get to Lut Gholein, I'm going to find the largest bowl of Narlant weed and smoke 'til all earthly sense has left my body.",
				"Akara and Kashya are Sisters in the Order of the Sightless Eye, but they are worlds apart. Akara is a slow river of magic, and Kashya, a viper of war. They're both deeply devoted to their religious order, yet the corruption of their Sisters pains them both to no end.",
				"Charsi is a fine girl..., but she has no business savvy! I know she means well, but the prices she charges for weapons and armor will never earn her a profit.",
				"As long as I keep filling her mind with stories of adventure, she'll never catch on to the fact that I'm raking in gold hand over fist!",
				"That old coot, Cain, is as crazy as a wet Quill Rat. I hear he survived whatever happened in Tristram. Personally, I wouldn't trust a thing he has to say.",
				"Warriv was kind enough to let me travel with his caravan, but don't let him drag you into a search for a new Eastern trade route.",
				"I'm making a fortune right here... from the Rogues, of course! You, on the other hand, always get my best prices!",
				"Don't think you can fool me, Necromancer. I've seen what your kind can do. If you're involved in any of the evil out there, I don't even want to know. Trade quickly and be about your business!"
		]
	},
	"charsi": {
		"name": "Charsi",
		"quotes": [
			"Hi there, I'm Charsi, the Blacksmith here in camp. It's good to see some strong adventurers around here. Many of our sisters fought bravely against Diablo when he first attacked the town of Tristram. They came back to us true veterans, bearing some really powerful items. Seems like their victory was short lived though, most of them are now corrupted by Andariel.",
			"Wow! You're a Barbarian!! Huh? It's really great to meet you. I've seen a few of your kind around here lately. I'm a little jealous, I wish I could go off adventuring with you. Oh by the way I'm Charsi the Blacksmith here in camp.",
			"I don't really know anything about Cain, he seems to have a lot of secrets. That makes me nervous.",
			"Oh Kashya's fantastic. Sure she's a little hard on outsiders, but who can blame her. All she wants is to protect our order. But now that our sisters have turned against us, I think all this mess has hardened her heart.",
			"Akara, our Priestess and Seer, is most upset by the corruption of our sisters. I fear that she blames herself.",
			"Warriv is alright, I guess. He seems too serious most of the time. I haven't really talked to him all that much.",
			"Oh, I like Gheed, he's very funny. He has all sorts of interesting stories from the places he's been. I wish I could see the sights he has.",
			"You know, I've been with the sisters for as long as I can remember. But Akara told me that my real parents were barbarians from the northen tribes, and that they were killed when I was very young. Sometimes I wonder what my life would've been like, if I was raised as a Barbarian. I don't know, I love being a blacksmith, but sometimes I just wanna get out and explore the world you know.",
			"The beasts from the cave have begun to roam throughout the countryside. You'd better be careful out there. You seem like a noble warrior. I hope you can help us.",
			"You haven't cleared the cave, yet? Do you need anything?",
			"You are truly brave and skillful ... Akara was worried about you.",
			"Blood Raven was the leader of a Rogue band that once fought Diablo at Tristram.",
			"Akara felt something was wrong even before Andariel descended upon us. She feared that Blood Raven had stumbled upon some evil force beneath Tristram. I wish we had acted then...",
			"Kashya wishes to reward you for your defeat of Blood Raven. I thank you, too, even though Blood Raven was once my friend.",
			"If you bring back the bark of Inifuss, Akara will tell you how to get to Tristram.",
			"Without the bark of Inifuss you can't find Cain.",
			"Get this to Akara. Only she can understand it.",
			"I have heard that Tristram is now in ruins! Without Cain, I fear for the ruin of all of us.",
			"Akara wishes to reward you for your bravery in returning Deckard Cain.",
			"That old tower is as rotten on the inside as it appears on the outside. I heard that several Sisters came to a gruesome end when a stairwell collapsed on them.",
			"You're not ready to give up, are you?",
			"Those riches will serve you well on the long road ahead.",
			"When I fled the Monastery, I left behind the Horadric Malus, my enchanted smithing hammer. If you can retrieve it for me, I'll use its magic to strengthen your equipment.",
			"The Monastery can confuse even those who know it well. Stay alert in there.",
			"The Malus is a Horadric artifact of great power. Please bring it back.",
			"Oh! Thanks so much for returning the Horadric Malus! I will now imbue one of your items with magical powers.",
			"Send Andariel back to the Hell she came from!",
			"If you are the hero that you seem to be, now is the time to prove it.",
			"You'll probably go east now... It was good to know you. I hope you'll come back if you ever need anything."
		]
	},
	"warriv": {
		"name": "Warriv",
		"quotes": [
			"Greetings, stranger. I'm not surprised to see your kind here. Many adventurers have traveled this way since the recent troubles began.",
			"No doubt you've heard about the tragedy that befell Tristram. Some say that Diablo, the Lord of Terror, walks the world again. I dont' know if I believe that, but a Dark Wanderer did travel this route few a weeks ago. He was headed east to the mountain pass guarded by the rogue monastery.",
			"Maybe it's nothing, but evil seems to have trailed in his wake. You see, shortly after the Wanderer went through, the Monastery's Gates to the pass were closed and strange creatures began ravaging the countryside.",
			"Until it's safer outside the camp and the gates are re-opened, I'll remain here with my caravan. I hope to leave for Lut Gholein before the shadow that fell over Tristram consume us all. If you're still alive then, I'll take you along. You should talk to Akara, too. She seems to be the leader of this camp. Maybe she can tell you more.",
			"Well met, noble Paladin. It's been a while since I've seen any of your kind in the west. It would be an honor to aid you in any way that I can.",
			"Cain seems to have great wisdom regarding the supernatural, I hope I never live to be that wise.",
			"Akara is the Rogue's High Priestess. She sells the few magic items in our possession, and can even heal your wounds. She's very wise and will help you if she can.",
			"The fiery Kashya commands the rogue archers in battle. I've only spoken to her a few times though, I get the feeling she doesn't like outsiders very much.",
			"Charsi seems to be a very sweet girl. She's the smith around here and can help you by trading weapons and armor.",
			"Gheed is a wandering merchant with questionable character who's traveling alone with my caravan to the east. He will buy himself most anything. He's greedy but his wares are beyond reproach, I would suggest keeping both eyes open when you deal with him.",
			"To the east, the lands of great mystery, and the jewel city of the desert: Lut Gholein.",
			"I'll gladly take you eastward, if you can drive the evil from the monastery. Then the rogues may reopen the pass through the mountains.",
			"It's easy to become lost in the wilderness on the way to the citadel. After you've come to the Cairn Stones you must remember that the path continues through the caves.",
			"I've been leading my trade caravan across the eastern desert for more than 20 years now. I've been attacked by bandits and outlaws more times than I can remember, but never when a Paladin accompained me. Indeed your order has saved me from losing a small fortune over the years. I just hope you can discover what's going on around here and get the gates to the east open up.",
			"One who seeks that cave, seeks death.",
			"One who hesitates, does so with good reason.",
			"That which does not kill you makes you stronger.",
			"Hmmm...How can one kill what is already dead?",
			"When the dead return to prey upon the living, it is a terror beyond understanding.",
			"You've done well, stranger. I hope all your efforts are worth it.",
			"Months ago, I came across a few survivors from Tristram. They said that Cain had gone half-mad and could no longer distinguish fact from fantasy.",
			"He who seeks that which cannot be found must look inside himself for further guidance...or look harder!",
			"This looks like gibberish to me. Akara may know what to make of it.",
			"It is too dangerous to travel to Tristram. I won't be leaving here until the way is clear!",
			"Only a brave adventurer could return with Deckard Cain. Akara has a reward for your valor.",
			"Rumors of treasure are no different from rumors of any other kind. They hold false promise to those who should know better.",
			"Better an empty pocket than a full grave.",
			"Remember, wealth is as insubstantial as a cloud and passes as quickly. Ignore Gheed. All that twitters is not bold.",
			"Just as an archer needs bow and arrow, or a draughtsman pen and paper, so Charsi needs the Horadric Malus with which to ply her trade.",
			"What better opportunity to show your mettle?",
			"I am glad the hammer has returned and you with it.",
			"The mapmakers tell us the shortest distance between two points is a straight line. Our way east is a line that runs through Andariel's stronghold, the Monastery.",
			"May I remind you that my caravan can only go east if the Monastery is cleansed?",
			"The caravan is prepared. We may now journey eastward to Lut Ghulein.",
			"Now that Andariel is dead, I can return and outfit the Rogues properly. Once I've made some trades here, I'll be free to head back to the Monastery. Let me know if you want to travel along.",
			"Caravans take people where they want to go... Until they get there.",
			"By ship is the only way eastward from here. I believe captain Meshif has a small trading vessel moored at the docks.",
			"There used to be a lot of brothels here. I guess the trouble scare all the women away. Or maybe they're safe in Jerhyn's Palace.",
			"That old desert fox Elzix is as crafty as they come. Years back he made out with a small fortune with my caravan wares. I certainly never expected to see him so... domesticated.",
			"I've met Meshif many times in my travels here. I've always enjoy trading stories with him about the exotic lands of the east. I heard he has sailed to many strange lands.",
			"Jerhyn has his father's strenght and wits. He's young, but he rules this place with wisdom and care. I think he'll grow into a fine sultan. Provided we all survive this crisis.",
			"I've heard tales of walking corpses out in the desert at night, though I've never actually seen one.",
			"Death is not afraid of the living, but the living abhore death.",
			"Atma is telling everyone what you've done for her.",
			"The sun has grown disgusted with the terrible deeds that must shine upon each day. Damnation is upon us all.",
			"The calculated coldness of the reptilian brain. Makes the Claw Vipers uncanny and bizarres.",
			"With renew daylight one may gather the wits that were scattered about light, unrestricted in the darkness.",
			"A careful caravan gives wide berth to sleeping bandits. If Horazon is gone, let him remain so.",
			"Fate is like a caged gorilla. It will pelt you with dung if you mock it.",
			"Well the news that are going around town is very unsettling, apparently we were in more danger that anyone thought. Good work friend, you may have saved all of our skins.",
			"There is nothing more dreadful than a powerful man driven by a frail mind.",
			"I guess you'll be heading to the tombs now, I hear that they're in the deepest of the desert regions.",
			"Be very careful my friend. I think I've seen enough recently not to doubt that this tombs really exist. And if they do, they must be certainly guarded by terrible creatures.",
			"Never fear my friend, you did the best you could. I suspect Diablo and Baal are now heading east towards Kurast, you will find them, I know you will."
		]
	},
	"hralti": {
		"name": "Hralti",
		"quotes": [
		"Truth be told, I didn't expect to see you again. Did you happen to see any magical weapons in Hell?",
		"Welcome to Kurast, traveler. Few come willingly to this ancient city anymore. I hope you brought your wits with you, for sanity is in short supply here. My name is Hratli.",
		"Welcome to Kurast, young Sorceress. Few come willingly to this ancient city anymore. I hope you brought your wits with you, for sanity is in short supply here. My name is Hratli.",
		"You're very brave to have come here. In the old days, mages who didn't belong to one of the great Mage Clans were hunted down as renegades. But now, the Mage Clans have little authority.",
		"Within the Temple City stands a tower built long ago by the Horadrim to imprison the... Well, you'll discover more about it soon enough.",
		"If you are another follower of Zakarum, I've told you people before I don't want your Towering Spire or anything else you have to sell!",
		"Some find my prices unreasonable. That is because I am unreasonable.",
		"You'll find that the Zakarumites have the persistence of zombies, but without the charisma.",
		"Asheara leads the mercenary company known as the Iron Wolves. You can hire some of them, but many are occupied securing the dockside.",
		"Alkor is a potion dealer given over to a life steeped in ceaseless study and dissipation.",
		"Ormus is a man of many mysteries. I sense strong magic about him, but he's never spoken of it to me.",
		"I trust you already know Meshif. But did you know that he was born and raised here? I suspect that like many of us his spirit is near broken at the sight of Kurast's decline. Only our brand of gallows humor saves us from utter despair.",
		"This, Cain, whom you brought with you. He has the bearing of great power, yet I sense no magic about him. He is an enigma to me.",
		"Natalya is a quiet one. She arrived here about a week ago and has pretty much kept to herself. She's inquired about my weapons a few times, so I assume that she's a warrior of some sort.",
		"You will have to take Ku Y'leh's ashes to Alkor.",
		"Ku Y'leh was a powerful sage who was rumored to have brewed a potion of immortality. In an ironic twist of fate, he was murdered before his potent elixir could take effect.",
		"We have long sought the Black Book of Lam Esen. Rumors of its whereabouts spread as fast as jungle plagues. If you find it, take it to Alkor.",
		"Not getting much help? You know, people are like rugs. Hang them out a window and shake 'em a couple times. You'll be surprised how much dirt comes out.",
		"We have the Book. Now we must see if we can bear its revelations.",
		"As I told you before, I placed an enchantment upon the dockside in order to keep the demons at bay. But lately, the enchantment seems to be weakening. If memory serves me correctly, there is a holy Skatsimi blade that could revitalize the enchantment. The blade is called the Gidbinn. Find it, and our sanctuary here will remain safe.",
		"As far as we know, the Gidbinn is in the possession of the Children of Light. They do not wish it to fall into the hands of those who can restore its powers. You may not believe it, but Ormus is the one who can use the Gidbinn to protect us.",
		"Once the Gidbinn is found, Ormus will use it to strengthen the protective barrier around the dockside. The Gidbinn's magic can only be channeled through Ormus. Take it to him. He has the necessary knowledge about the ancient Skatsimi magics.",
		"Remember. You can always find sanctuary here with us.",
		"This has been a trying time for all of us, but I sense this nightmare is coming to an end.",
		"The followers of Zakarum demand complete allegiance to their creed. They have slaughtered many of their own for minor grievances. They will not hesitate to kill you.",
		"After having served Mephisto all these years, the Council must be twisted by hatred and evil.",
		"The followers of Zakarum lacked all sense of moderation. The collapse of their tainted religion gives me hope.",
		"Mephisto, along with Baal, was originally captured in the desert near Lut Gholein. But imprisoning two of the Brothers together was far too dangerous. The Horadrim built the Guardian Tower to hold Mephisto. When Zakarum came to power in this land, it took over the Temple City without paying any heed to what was locked within the Tower. And it became their doom.",
		"I hear there is a little family reunion about to take place in Kurast. The Three brothers draw close.",
		"Why build a Tower to place the beast below ground? At times I believe the Horadrim lacked common sense.",
		"Shouldn't you be running frantically up and down stairs about now?",
		"It looks like you're going to Hell before me. Put in a good word."
		]
	},
	"drognan": {
		"name": "Drognan",
		"quotes": [
			"I've heard that you are responsible for banishing Andariel back to the Burning Hells. I'm impressed, stranger. That couldn't have been easy. My name is Drognan, and I know what you're up against, my friend. You ought to look over my inventory of items for trade.",
			"Allow me to advise you.",
			"Approach and let's trade.",
			"Ask and learn.",
			"Welcome back, stranger. I hope the battle goes well in the east.",
			"Welcome, young Sorceress, to Lut Gholein. I hope your skills are a match for the horrors that lie beyond the city's walls. A mage of your limited experience may find the evil too great to withstand alone.",
			"Fara and I have been talking about the creature recently. From my studies, I have deduced that it is Radament the Fallen, an ancient Horadric mummy that has for some reason left his tomb to prey on mortals. I'm doing some more research now. If you check back later, I may have some more insight as to his nature.",
			"I've just been reading something interesting about this sort of undead. Apparently, certain Horadric funereal priests altered the bodies of their dead mages with magical and surgical techniques -- often replacing body parts with those of animals. This was thought to augment their powers, and raise their status in the afterlife.",
			"From what you tell me, it would seem that Radament was bent on the task of reviving his own mummified corpse with the flesh of the living. This is very unusual indeed. It takes an incredible magic power to alter the singular purpose of an undead mind. Perhaps there is a power at work here which is beyond my ken.",
			"I've been researching this lengthy eclipse and I believe it to be the work of Claw Vipers. Find their temple beneath the desert sands and you may find the source of this curse.",
			"I've discovered a reference to a similar eclipse several hundred years ago. It says that some desert-dwelling snake demons had erected an evil altar, which caused the sun to go black. Perhaps we are dealing with something similar here. Look for an altar in the Claw Viper temple.",
			"You did well in destroying the Claw Vipers. We are all glad to see the sun returned to its former glory.",
			"I've been researching the old records, trying to find the location of Tal Rasha's Tomb. Though I haven't found the Tomb, itself, I may have a good lead for you.",
			"The great Vizjerei Summoner, Horazon, built his Arcane Sanctuary somewhere around here. He was a powerful spellcaster and kept demons as slaves within the Sanctuary. He kept a close eye on great events, too -- such as the imprisonment of Baal within Tal Rasha's Tomb.",
			"If you could find Horazon's Sanctuary, I'm sure that it would hold some clue as to the Tomb's location. Though I doubt Horazon is still alive, you must proceed with caution. There's no telling what could be waiting inside.",
			"When I spoke of this with Lord Jerhyn, he asked that I send you to him. Perhaps he knows of a secret entrance or the like.",
			"Nearly a thousand years ago, Horazon rose to the fore of the Vizjerei mage clan. Horazon used the knowledge of the Vizjerei to summon and control demons from Hell.",
			"Though a powerful Summoner, Horazon feared that the Lords of Hell would punish him for enslaving their brethren. Thus, the Summoner created for himself an Arcane Sanctuary.",
			"He believed that his Sanctuary would not only protect him from Hell's vengeance, but also allow him to continue his studies free from the ravages of time and disease.",
			"Horazon had crafted many wondrous scrying devices through which he observed the events of the world outside. It is certain that he took careful study of Tal Rasha's imprisonment and recorded the location of his forgotten Tomb.",
			"The Arcane Sanctuary was believed to have been constructed here in Lut Gholein. An entrance may be hidden somewhere in the palace, as that building is very old, and was once a Vizjerei fortress.",
			"I am certain that you will find the information you need when you find Horazon's Journal. I suggest you find it quickly, for Diablo may be getting closer to freeing his brother as we speak.",
			"You have found Horazon's Journal. Excellent... But, I must caution you. The mark of the True Tomb of Tal Rasha, is sought, if not already known, by Diablo. I needn't elaborate on the implications of that.",
			"Yes... The man you speak of sounds like the mage who came here many months ago. He claimed to have fought Diablo in the passages beneath Tristram. No doubt the fool wandered into Horazon's Sanctuary and lost whatever was left of his ravaged mind. He is beyond salvation.",
			"It is possible that the fool has been possessed by the spirit of Horazon. If that's true, then you'd better put an end to his tortured existence. Once done, I believe the demons who were summoned and imprisoned within the Sanctuary will cease to exist as well.",
			"Larger forces are moving inexorably towards us. You must now make haste to the Tombs.",
			"Tal Rasha's tomb is hidden deep in the desert among six others. Tal Rasha's symbol marks the True Tomb. If you want to know what that symbol is, you should be able to find it within the legendary Arcane Sanctuary.",
			"This is a serious setback... It is most unfortunate that Tal Rasha has been consumed by Baal's destructive influence. There are many secrets known to the Horadrim, which could be used by Baal against us.",
			"You must travel east by sea to Kurast and stop Diablo and Baal before they free their eldest brother, Mephisto. Hahh... The lands of the eastern Empire are not the same as they used to be. There has been little word for some time. Speed is of the essence. Go quickly, my friend. May the fates smile on you.",
			"The Horadrim were a powerful Order, although maybe too prideful. Tal Rasha was one of their Order. And that should tell you something.",
			"Any man who believes himself strong enough to contain one of the Prime Evils is in for a rude awakening, I should think.",
			"Not long ago, one of my Vizjerei comrades, who I believed had died in Tristram, came to this city. He seemed quite insane, so I dismissed much of what he said.",
			"However, he was able to talk his way into Jerhyn's palace. No one has seen him since. I fear that fool may have found something in the palace that led to his doom.",
			"I've been practicing magic for more years than you could know. I'm older than I look, though not so old that I can't conjure up a few sparks.",
			"Demons have spread throughout the desert wasteland and threaten to engulf our quiet port-city.",
			"I have heard of your friend, Cain. He is the last of the Horadrim. You would do well to heed whatever advice he has to give you.",
			"Elzix is a sly one, I'll give him that. Of course, he never tries to cheat me. He knows what my magic skills can do.",
			"When the recent troubles began, Lord Jerhyn came seeking my council. I advised him to close the port and put the town under strict watch. Lately, though, he's been occupied within the palace. I doubt his whores could divert him from his civic duties for this long, though.",
			"Lysander is harmless enough. We keep each other company with our mutual interests, yet I don't think he could handle the enormity of our present situation.",
			"Meshif and his vessel should remain here, lest we risk taking demonic stowaways to other lands.",
			"Many of the Mage Clans feel that women shouldn't practice magic openly. But since you've made it this far, I must say that you have proven your right to do so"
		]
	},
	"elzix": {
		"name": "Elzix",
		"quotes": [
			"Hmm...You look like a sturdy adventurer. You know, I used to be quite the scoundrel in my day. I led the fiercest group of bandits who ever terrorized these sands! Nowadays, I run this here Inn and pretty much stay out of trouble. [chuckles] My days of adventuring are behind me."
		]
	},
	"geglash": {
		"name": "Geglash",
		"quotes": [
			"Heyyyy.",
			"Let me buy you a drink.",
			"So you've been to Kurast, huh? Did you happen to bring back any Skatsimi ale-potions?",
			"Bah! I don't know why you people keep pestering me. Greiz seems to have this place locked down nice and tight. Not that I couldn't have done the same! I've proven my valor in combat plenty of times.",
			"Hey, you're a Barbarian, aren't ya? Ferocious as the wild beasts of the north, that's what they say. I suppose you've come to help save this city. You needn't bother. Greiz seems to have this place locked down nice and tight. Not that I couldn't have done the same! I've proven my valor in combat plenty of times.",
			"Hey, I heard that you Barbarians can wield multiple weapons at once. I never learned to fight two-handed. Carrying a sword and a wineskin at the same time is all I can ever handle.",
			"Sure, I hear lots of what goes on. Did you hear about the harem guilds? They were the only ones allowed to hide out in the palace when the raids started! Ah... It figures.",
			"I've killed plenty of those demons out in the desert. It doesn't seem to slow them down any, though... they just keep coming back for more.",
			"Have you found those big sand maggots yet? Arrows and all that don't work so well against them. Best thing is to hack 'em with a sword or such.",
			"There are some ancient tombs out there in the desert. You have to go pretty far to find them, though. Rumor has it that they're crawling with walking corpses now. As if the Saber Cats and Claw Vipers weren't bad enough.",
			"Yeah. Meshif's okay, I guess. But I'll be damned if I ever get on his ship. I don't even like to drink water.",
			"Jerhyn's been acting strange lately. I can't imagine why he recalled the town guards into the palace. If there is something wrong in there, I hope he doesn't expect me to handle it.",
			"I've seen Fara defend herself against a few drunken ruffians. She's got moves I've never even seen before. Wherever she's from, she sure learned how to fight there.",
			"I've got no time for old alchemists. Lysander would be completely useless in a real fight.",
			"Hey... Don't touch my drink or I'll bore a hole into your skull with my thumb.",
			"Ah-hah! Back for a small shot of courage... Believe me, it doesn't help for long. [guffaws] Drinks, barkeep!",
			"Whoah oh... 'Radament the Fallen', is it? I've fallen off my bar stool a plenty, and no one has ever called me 'Geglash the Fallen'. They might go so far as to say, 'Geglash, you've fallen! {laughs}" ,
			"This whole place is one big ale fog.",
			"It's strange when the morning after the night before... is still the same night.",
			"So, this is daylight... It's over-rated.",
			"Look, look... I'm just about as tough and arrogant as they come, but you'd never catch me trying to tame a demon for a pet. That's just asking for a lot of trouble.",
			"All my years of brawling, of pummeling both the unsuspecting and the deserving, have yielded two insights. You can either fight or you can run. All other strategies are variations of these.",
			"Hah! I wish Jerhyn would've let me in the palace. I would've saved those girls and kicked demon ass back to the fire-pits o' Hell!",
			"So! Horazon's crazy, eh? I'd be surprised if he wasn't. All those centuries without ale would drive anyone to drink... but then you couldn't drink. And that would drive you to drink... Hah?... What was the question?",
			"The way I see it... Well, it's all pretty blurry.",
			"Ohh... I'd go with ya' to those tombs... But... umm... I don't like all that living dead stuff.",
			"You're an inspiration! And such a hero that it makes me look twice as bad... Ahh, you're OK... Hey! Just save some glory for us little guys, huh?"
		]
	},
	"lysander": {
		"name": "Lysander",
		"quotes": [
			"Hello.",
			"Huh? Did you say something?",
			"There's nothing the right potion can't cure.",
			"Back again, uh?",
			"Welcome to my shop.",
			"Well, what the hell do you want? Oh, it's you. Uh, hi there.",
			"How do I know I can trust you? Hmm? You may be as shifty as that pack rat, Elzix, who runs the Inn. But, if you need a potion, though, I suppose I can make you one... for a price, of course.",
			"Potions are delicate mixtures. They're just as liable to go off in your face as anything.",
			"Ah... The sweetest desert flower - that's Atma. Even my strongest brew can't bring back her family, though.",
			"There are some ancient enchanted fountains in the desert that can heal your wounds - if you drink enough from them.",
			"Oh. Deafness has its advantages, you know. I'm no longer forced to overhear the tedious gossip of others.",
			"I never patronized the brothels, mind you. But since those ladies took up hiding in the palace, there certainly has been less scenery to feast my eyes on.",
			"Oh... I have great faith in Greiz. He seems to have things well in hand.",
			"I've traded my potions to Warriv many times. Yes. They seem to fetch a good price in the western lands.",
			"I've sold many sea-sickness potions to Meshif over the years. It seems that many of his passengers don't take well to the rocking of his ship on the open seas.",
			"Oh... Young Jerhyn used to purchase minor love potions from me, hoping to win the favors of the harem girls. But now that the girls have taken up residence in the palace, he doesn't come around here anymore. Well, well... I've always said, 'alchemy is no substitute for experience'.",
			"Drognan? Oh.. He's a good friend of mine. I help him find exotic spell components and alchemical books from time to time. I think he used to be a sorcerer of great renown, but he doesn't like to talk about his past.",
			"I hear that beast is after body parts. Does he eat them? Oooh... Ghastly!",
			"Huh? Peppermint? Oh, Radament! Yes, yes. Ooh, a foul creature... Some of my exploding potions should do quite nicely against him. They usually work well against the undead.",
			"Uh... Little of what I am able to hear is of any value. Radament's death, however, is news worth hearing. I'm sure Atma will be glad to hear of this.",
			"Claw Vipers! This outer darkness mirrors the inner blackness of their souls. It is they who have eclipsed the sun, I'll wager. They are a venomous band.",
			"Well... I don't know much about the habits of Claw Vipers, to be honest. Drognan will probably know something about the nature of the magic at work.",
			"Ahhh... Claw Vipers are fond of magical artifacts. Did you happen to find one in their temple?",
			"Horazon found it necessary to lock himself up for all time, just to protect himself from those angry demons. Such is the fate of one who practices the summoning arts... that, or eternal damnation. There's old summoners and bold summoners, but no old, bold summoners.",
			"Huh? The horizon is always out of reach, you should know that. Oh, Horazon! Oh, I see. Uh. Yes. Well. He was insane. Brilliant, yes, but... total lunatic.",
			"Horazon's urinal? Oh, journal! Yes, well... Glad you found it. Such a shame about those poor harem girls, huh? I shall miss them deeply... I mean their conversations, of course.",
			"Ah, yes. I remember. There was a... fellow around here many months ago who asked almost as many questions about Horazon as you. So... He discovered enough to assume Horazon's place in the Arcane Sanctuary, huh? What a fool!",
			"Huhhh... Such is always the fate of those who meddle with evil.",
			"When Tal Rasha chose to embody the spirit of Baal, he knew his doom was to wrestle eternally against the will of the greater Evil. Look around you and ask yourself, 'Has the battle been won or lost?'",
			"I'm sorry things didn't turn out as you had hoped. Go and remember us fondly. You know, you bothered me far less than most."
		]
	},
	"meshif": {
		"name": "Meshif",
		"quotes": [
			"Ahoy, mate.",
			"Hello again. Let me know when you've had enough of this place. I'll gladly sail away from here.",
			"My ship is your ship.",
			"Greetings. I'm Meshif, captain of this ship here. I make port runs around the Twin Seas and occasionally out to Kingsport in Westmarch. I haven't sailed anywhere lately, though... Jerhyn has ordered me to stay docked here in case of emergency.",
			"Greetings, Amazon. I haven't seen one of your kind in many years.... It's good to know that warriors of your caliber are protecting this city.",
			"There are two entrances to the sewers, I believe. One of them is right near here, down by the water beneath the docks. I can see it from my ship, and you can bet I keep an eye on it every night.",
			"I noticed a rotting, human arm floating in the harbor this morning. I suspected foul play, so I told Greiz. He didn't seem too concerned since there haven't been any folk reported missing lately.",
			"Good job mate! At night out on my ship, I was often awakened by that fiend's awful moaning. I bet I rest easier now.",
			"This permanent darkness is very unsettling. Hmmm... It would make navigation by stars easier for me, though.",
			"I've had about enough of this darkness. I don't even know what day it is anymore.",
			"So... Did you plunder any booty?",
			"Ahh... The legend of Horazon is an old one, especially around these parts. You wouldn't believe the feats and strange events that are attributed to him.",
			"So... Now that you're such a pal of Jerhyn, why don't you ask him if I can set sail one of these days? I'm running out of patience.",
			"So... Now we know Jerhyn's little secret. Well... I guess I can see why he wanted me to stay, though... I'm just glad it didn't come to that. Now he tells me to wait some more, in case you need to get out of here. Well, for you I'll do it. Maybe they'll mention me in the epic ballads, eh?",
			"Ah, yes. As a ship captain I am well aware of the phenomenon of a false Horazon. Sorry, just a little joke.",
			"Well! You've got what you're after. Now get a move on before it's too late.",
			"I'm sorry, I can't help you much here. Now, if the tombs were across the ocean, then I'd be the guy to talk to.",
			"Jerhyn tells me I should take you east to Kurast. I haven't been there for several years, but rumor has it that things are pretty grim.",
			"I've been all around the seas in these parts. It's dangerous sailing west this time of year, though. Until the season changes, the caravan through the desert is the main trade route to Westmarch.",
			"My ship is the only way East from here. Still, Lord Jerhyn tells me that I may not leave until the current crisis is over.",
			"Atma serves a fine ale in her establishment.",
			"Oh, I've known Elzix for years. He always offers me a free room at his Inn when I dock here, but I prefer the comforts of my own cabin.",
			"The lady Fara has a proud, noble air about her.",
			"Hah! That braggart Geglash says he fears neither man nor beast. Yet, when I offer to take him out to sea, he quakes with fear.",
			"Greiz seems to be a dependable fellow. I hope he can handle it if those things in the desert decide to attack this town.",
			"There's something Jerhyn's not telling me, I just don't know what. To my eye, things here in town don't look that bad, especially since Warriv's caravan route opened up.",
			"Warriv is a good friend. We've shared many tales, he and I. If we had it all to do over again, I believe we'd both be explorers of some renown.",
			"I was wondering if you've heard any news from Kurast? I know you Amazons travel extensively. Have you been there recently? Hmm... Well, I hope the port opens soon. I need to get home to Kurast and find out what's been happening there.",
			"Well, I gave you my word, and brought you here as promised. But by all that's still holy, I wish I'd never returned to this accursed place. This fetid jungle can't be the fair Kurast I left behind.",
			"I don't know what all this evil is, my friend, but it's obvious that you must stop it. I only pray that you can before the jungle consumes the last vestiges of my beloved homeland.",
			"Being a Barbarian, I'm sure you've seen many strange sights in the northlands. But by all that's still holy, I wish I'd never returned to this accursed place. This fetid jungle can't be the fair Kurast I left behind!",
			"If this evil isn't contained, it could spread north to your homeland, too. Then the whole world would fall under the shadow of the Three.",
			"Praise you! That jade figurine will complete the set I was collecting. Here! I've had this statuette of a golden bird for years, but I consider it a fair exchange.",
			"Immortality is definitely not for me. Can you imagine having to wake up every night just to piss for the next thousand years?",
			"The Gidbinn is one of the few remaining relics of Skatsim, the Old Religion. It is reputed to have great powers.",
			"The jungle is like nothing you've ever seen before. Imagine Paradise festering like a wound... then bursting!",
			"With any luck, the spirits of Skatsim will grant us revenge upon the powers that ravaged this land.",
			"Oh. No one really believes that the Black Book exists. It's just a symbol of Zakarum's anti-Skatsim propaganda.",
			"Kurast was once the greatest city in the world. Now it is hard to tell where the jungle stops and the city begins. The jungle grows rampant on the soil enriched by the blood of my fellow citizens.",
			"Thank all that's holy. You've returned with the Black Book! Maybe now you can put an end to the Evil that has destroyed my homeland.",
			"There is only one way to the Temple City. You will have to cross many rivers and streams, but you'll find it. A great tower stands at its center.",
			"It has been said that Ormus speaks most clearly when his ideas are utterly mad.",
			"Within the Temple City is a courtyard. The Council resides there.",
			"I have heard rumors that the Prime Evils are here seeking their Brother.",
			"It seems the jungle is already dying back. You've broken the curse, my friend! May the Light bless you!",
			"Be careful when you return to the Tower. Though many of the followers of Zakarum have fled, there's no telling what horrors still lurk inside it.",
			"Move quickly, my friend, and end this curse once and for all!",
			"I ought to return to the ship. We may have to sail from here very quickly.",
			"Ahh... Now, Kurast can begin the task of rekindling its former glory... I thank you.",
			"I shouldn't have boasted so much about Kurast on the journey here. Oh... Much has changed since I left.",
			"The dockside is apparently the only civilized area left in Kurast.",
			"All through my childhood, Kurast was a paradise. The once perfumed air now reeks of putrefaction.",
			"I went to speak with old Alkor, but I disturbed his studies. He doesn't seem to like visitors.",
			"If you are planning to carry on your wild ways here, you may need the assistance of Asheara's Iron Wolf mercenaries.",
			"Your companion, Cain, must have known that he would be in grave danger here. You are great, indeed, to elicit such loyalty.",
			"Hratli seems to be the only one left here with any common sense. Yet how sensible is it to remain here?",
			"That woman, Natalya, seems to be waiting for something important to happen. She's a strange one, I think.",
			"Trying to get information out of Ormus is like straining water from a rock. His damned riddles are almost as confusing as our current state of affairs.",
			"It takes great courage and generosity to defend a land and a people that are not your own. Perhaps, when this curse is lifted, my people can do something for yours in return"
		]
	},
	"kaelan": {
		"name": "Kaelan",
		"quotes": [
			"You may not pass.",
			"Stay out of trouble.",
			"Welcome to the Palace.",
			"You may enter the Palace."
		]
	},
	"greiz": {
		"name": "Greiz",
		"quotes": [
			"Who goes there?",
			"Need some help?",
			"Yes, citizen?",
			"Come back this way, have you? What, didn't you see enough action here the first time?",
			"I'll bet you wonder how this town manages to stay safe with all the trouble going on out in the desert. Well, I can tell you that it's got nothing to do with the local town guards... they're all in the palace for some reason. Jerhyn hired me and my mercenaries to help keep the peace around here. We're not cheap, but we're the best this wasteland has to offer.",
			"We do a good job in town, but beyond the city gates, you'll find all manner of demons.",
			"The local guards were all relocated to the palace after the troubles began. No one really knows why. Actually, all of the town's brothel girls have been hiding out in the palace's cellar lately, so I assume that the guards have been assigned to 'protect them' with their lives.",
			"I might spare you a few of my men. Why, enough gold can muster an army.",
			"Jerhyn's got a nice little trading post going here. Despite his youth, he is a clever businessman. As you can see by that palace, he's done quite well for himself.",
			"We're keeping the town safe and tight, but I've got a hunch there's something Jerhyn's not telling us.",
			"Ah, Elzix is quite a character. I had a few run-ins with his band of outlaws in my younger years. Now, he's as settled as the dunes out there. The Desert Rain Inn is his pride and joy these days.",
			"Atma seems to be a fine woman. But I'm sure the loss of her family has made her lonely. Perhaps I should go over and console her when I get off duty tonight...",
			"Geglash is an imposing warrior, but he's never been able to back down from a fight. One of these days, his pride will be the death of him.",
			"Meshif has sailed all around the southern seas and visited many strange lands. It must be driving him mad, having to stay anchored here.",
			"I haven't talked much to Fara. She keeps to herself most of the time. I get the feeling that she doesn't like us mercenary types much.",
			"I'd stay clear of Lysander, if I were you. He's always mixing his damned potions and chemicals. I wouldn't be surprised if he winds up blowing himself to smithereens!",
			"Drognan's a mystery to me. Then again, I never did trust mages much.",
			"I've personally found some of that devil's victims washed up out of the sewer. Often, they are missing limbs or a head, and their bodies have always been skinned. At first the creature raided the town at night... That's how Atma lost her family. Now we've got him barricaded in the sewers. You're safe up here on the surface, but every now and again some fool wants to be a hero and heads down to the waste tunnels with a pig-sticker. [chuckles lowly]",
			"We've been meaning to send an organized group down there to kill that thing, but it would be dangerous. We just can't afford the chance of losing any men with all the trouble that's going on in the desert.",
			"You've killed Radament, eh? That's quite a nice piece of work! If you ever need a job as a mercenary, I'd be happy to sign ya' up.",
			"This midday darkness reeks of foul magic! My men and I are trying to keep the peace, but this kind of thing really scares people.",
			"Don't worry! My men and I have an iron grip on this town. If those cursed Claw Vipers are plotting anything against us, we'll be prepared for 'em.",
			"I'm glad that's over with!",
			"The only thing in Jerhyn's cellar are the harem girls that have been hiding there since the troubles began.",
			"What's got you so occupied in the palace? Don't tell me you're finding the Harems more compelling than killing demons? That would be out of character for one such as yourself.",
			"Unbelievable! The Harem girls are dead! The palace guards have been fighting off demons from the cellar. How could that happen without my knowledge?",
			"That guy really talks like that? Sounds like either Horazon has gone stir-crazy or that's some impostor.",
			"So, Horazon's been dead for some time. I take it you at least found what you were looking for.",
			"If you're going into the deep desert, why not hire a few of my men to watch your back?",
			"I've heard that your foe got away from you this time. Well, look at it this way... you've got the demons on the run. If you're going to be leaving, then... Well, thanks for your help."
		]
	},
	"alkor": {
		"name": "Alkor",
		"quotes": [
			"Damn it, I wish you people would just leave me alone! I... Oh, you're new here, aren't you? I am Alkor, the Alchemist. I dabble in potions and salves, and I can sell you some if you really need them. But don't make a habit of coming here. I don't like to be disturbed while I'm studying!",
			"Damn it, I wish you people would just leave me alone! I... Oh, you're a Necromancer, aren't you? I've heard that your kind use powerful potions and such to wake the dead and control spirits. I'd love to discuss what components you use some time. I am Alkor, the Alchemist. I dabble in potions and salves, myself, and I can sell you some if you really need them. Feel free to drop by anytime.",
			"Even I can tell that the evil in the jungle is growing. I hope you survive out there, my pasty friend. I'd still like to discuss what components are best used in necromantic potions.",
			"Care to take a gander at my Grimoire?",
			"I've never claimed that you'd live forever after trying one of my potions! Merely that you might look as though you had.",
			"I keep a library of tomes - heretical, exegetical, hermeneutical and pharmaceutical.",
			"I hope you don't object to my badgering the witless.",
			"You came here with Meshif? That old 'tour-guide to the stupid'! I'm surprised you made it here in one piece.",
			"Oh, Asheara's a good customer. She buys a potion of manliness from me every week.",
			"Hratli's only good for making his silly magic weapons. It's not like he's got the stones to actually go out and use them on anything.",
			"Oh, Ormus has been talking in riddles for years. I think he does it to cover up the fact that he's got nothing intelligent to say.",
			"Yes, Natalya is a cute girl. However, I think she could use a special potion. Let me see here, 'Radiant Beauty'... No. 'Ray of Sunshine'... No, that's not it. Ah, here it is: 'Relax Frosty Bitch'. This should help her out.",
			"Ah, the Golden Bird of Ku Y'leh. Thank you, my friend. Busy yourself while I experiment with the ashes within it. Then, return and see what I have made for you.",
			"From the ashes of Ku Y'leh I have mixed for you a potion.",
			"It pains me to waste time with you, so I'll get right to the point. There is a very special book which you must find for me. It was written long ago by a sage known as Lam Esen, who studied Skatsimi magic and the effects of the Prime Evils on the mortal world. The Black Book was lost when the Children of Zakarum took over this land. Now, you must reclaim it without delay! Its knowledge may aid us in this dark time ahead.",
			"The Black Book contains powerful secrets of Skatsim, the Old Religion, long eclipsed by Zakarum. I should warn you. The Black Book is much sought after by both good and evil. Be wary.",
			"Did I neglect to mention that the book contains useful information about the Prime Evils?",
			"You have found the Book! It should give all of us here some insight into the nature of the Prime Evils... Ah, but as for you...",
			"Have you not heard of the Gidbinn? Well, allow me to reduce your ignorance on the subject. The Gidbinn is an enchanted dagger - a religious artifact greatly valued by the Old Religion, Skatsim.",
			"Legend has it that the Skatsimi priests placed great power within the small blade. Power enough to repel this terrible jungle-curse which encroaches on our sanctuary.",
			"Hah! You have stolen the fabled blade from right under Zakarum's nose! This is a great day, indeed!",
			"The Black Book contains some vague prophecies regarding this undertaking. I'm not so sure it will turn out well for you.",
			"I am but a potion dealer and an avid reader of occult books. What do I know of the Travincal?",
			"Kill as many as you can. I have a morbid love of excess.",
			"If only we could have found the Black Book. I feel as though a malevolent hand has led us away from it.",
			"You've accomplished the impossible! By killing the Council, the curse of Zakarum will be lifted and our land will be free! Oh. Thank you!",
			"The hidden ways of the Tower are long forgotten. Though... it is rumored to have been built as far below the ground as above it.",
			"We have seen Diablo, but remain unsure of his Brothers' whereabouts.",
			"Well, the good news is that events are unfolding just as Lam Esen foretold. The bad news is that the story ends in our utter ruin!",
			"I'm afraid both fear and a large dose of elixir preclude me from answering.",
			"Your news is great indeed. You have saved us all. I would smile, but I'm afraid my face might collapse."
		]
	},
	"natalya": {
		"name": "Natalya",
		"quotes": [
			"Greetings, hero. I've heard of your exploits and... I'm quite impressed. Very few mortals are capable of dealing with the Three and their minions as you have.",
			"My name is Natalya. I am a hunter of Evil, part of an ancient Order sworn to hunt down corrupted Sorcerers.",
			"If I could, I would gladly join your quest to stop the Three. But I must wait here for further news. I can't predict what will happen, but the danger is greater than we can know. Until I receive my orders, I'll assist you with the information I have.",
			"My Order has been keeping watch over Ormus for many years, now. He seems to champion the cause of good, but who knows what shadow lurks within his soul?",
			"Hratli is a master craftsman. My order could make use of one with his unique skills.",
			"Asheara? Oh, she's a tough-talking mage, but I'd wager she's never faced true Evil. Pampering drunken mercenaries is one thing, but standing face to face with a Hell-spawned Demon is another.",
			"I've heard the name of Deckard Cain many times. He's the last of the Horadrim, and thus, I must honor him. You must be powerful, indeed, if one such as he accompanies you."
		]
	},
	"asheara": {
		"name": "Asheara",
		"quotes": [
			"I'm surprised you made it back all in one piece. Most mortals who come back from Hell are usually dead... or undead as it turns out.",
			"Hello, there. You must be a great adventurer to risk coming here. My name's Asheara, and I lead the mercenary band of mages known as the Iron Wolves. We've been hunting down demons in the jungle for months, but no matter how many of them we kill, they just keep comin'. Seems this whole place has been overrun by evil.",
			"Rumor has it that you've come here to help. If that's true, then I'll let you hire some of my mercenaries. But be careful... If you piss them off, they can be worse than those monsters out in the jungle.",
			"Hello, there. You must be an Amazon. I've heard about your people... nomadic warriors without peer.",
			"Legend has it that those who murdered Ku Y'leh for its secrets wound out losing its coveted ashes. They died of old age and madness.",
			"Only Deckard Cain can make sense of this.",
			"Such a beautiful statuette... But, you'd think it would've been better cared for. There's a compartment here that's full o' dust.",
			"The Gidbinn will reinforce the enchantments that protect the dockside from the evil that infests Kurast.",
			"I'm certain that the Gidbinn is very closely guarded.",
			"Now that fewer of the Iron Wolves are needed to guard the dockside, some of them have volunteered to accompany you free of charge.",
			"The Iron Wolves who have ventured down there report that the muck teams with loathsome creatures. There are also deeper levels, but they've all been flooded for some time.",
			"Many things can be found in the city of Kurast. The book may be there.",
			"I believe I can trust you now. When you first arrived, I suspected you a spy for the Zakarum, the false religion whose faithful are now under the sway of a mysterious power. They've made a mockery of the Old Religion of Skatsim.",
			"The Iron Wolves are very impressed by your skills.",
			"Most NPCs have two sets of dialogues during this quest. The default is seen when a character has already completed the Lam Esen's Tome quest and/or the Khalim's Will quest. The alternate (more commonly seen by players) is delivered if those quests have not yet been completed (and the Black Book is still missing and/or the Zakarum are still a threat).",
			"The Children of Zakarum who guard the Tower square can be killed, but their numbers are vast. You must destroy their Council.",
			"There are many zealots among the followers of Zakarum. It will be difficult to get past them.",
			"The Iron Wolves and I are at the ready to aid you.",
			"Things are getting wilder than Ladies Night at the Slippery Fist.",
			"The sun has set on the Religion of Light.",
			"I sent a few of my Iron Wolves on a scouting mission into the jungle near the Temple City... They encountered two cloaked men who attacked them with horrifying powers. My men barely survived. I have to assume that the two strangers are Diablo and Baal. You'd better hurry. They're close to finding their brother.",
			"Many Iron Wolves have disappeared in Travincal. The Evil is still strong there.",
			"The sudden reduction in our ranks makes us eager to destroy Diablo and his brothers. Vengeance for the Iron Wolves!",
			"We will fight to the death.",
			"Well done, my friend. You are a great champion of Order. Please, consider yourself an honorary Iron Wolf.",
			"Why fight fair, when you can hire some of us?",
			"No one comes to Kurast anymore without good reason. You must be seeking fame and fortune.",
			"The Iron Wolves and I have made a good living around here lately.",
			"The jungle can take you down fast. Try to avoid getting trapped out there if you can.",
			"Hratli may be a bit too clever for his own good. Still, I'd trust his work anytime.",
			"Hratli thinks he's so funny. The other day he said, 'Asheara, I don't recognize you without that big gash on your face.'",
			"Meshif says he used to live here. I'm surprised he came back. I'll bet he wishes he hadn't.",
			"I invited Natalya to join the Iron Wolves and she began lecturing me about the 'dangers of magic'. Who the hell does she think she is, anyway?",
			"Your skills are unique indeed. They are neither sorcery, nor physical, but seem to be a harmonious blend of the two. The Iron Wolves could learn much from your kind"
		]
	},
	"ormus": {
		"name": "Ormus",
		"quotes": [
			"Back so soon? Don't be ashamed. Even Ormus knows that the fires of Hell would wilt any man resolve.",
			"Good to see you.",
			"Good to see you again.",
			"You now speak to Ormus. He was once a great mage, but now lives like a rat in a sinking vessel.",
			"You have questions for Ormus and doubt in yourself. Ormus sees a strange dichotomy in you... as he does in all would-be heroes. Speak to him and he may grant you wisdom in turn. Or turn from him and seek wisdom in thyself.",
			"You now speak to Ormus, good Paladin. He was once a great mage, but now lives like a rat in a sinking vessel",
			"Ku Y'leh, in searching for immortal youth, found only an early death. His apprentices, seeking to live forever, burned his body in order to derive benefit from his ashes.",
			"Ormus remembers the tale of Ku Y'leh. That venerable sage forgot that there is no life beyond death. There is only life. Once prolonged unnaturally, it can become a living hell.",
			"If Alkor can make you a potion to live after death, use it wisely. Few mortals ever get a second chance at destiny.",
			"Ormus is familiar with the Gidbinn. But how would a powerful Skatsimi artifact aid an unbeliever like you?",
			"If we are to have peace from the shadow, you must find the weapon which will destroy the Light.",
			"You have done well, noble hero. Ormus congratulates you. The old spirits of Skatsim will watch over you for returning their sacred blade. Now, after all these years, Ormus will once again use his powers to protect the innocent from the shadow. The spell that protects the dockside shall now be reinforced.",
			"This magic ring does me no good. Here... Wear it proudly!",
			"The Children of Zakarum believe that the Black Book is filled with blasphemous heresy. In truth, the book may contain the secrets to our ultimate redemption.",
			"Even if you find the sacred Book, you must still traverse the jungle of meaning within it. That journey could prove to be far more perilous.",
			"Why is the Black Book of Lam Esen like a coffin? Simple. Each holds the shape of our future.",
			"You have done well, my friend. Your courage and valor are an inspiration to us all. But now the time has come to face those responsible for the evil that has stifled our land. You must destroy the High Council of Zakarum!",
			"Long ago, these elders were charged with the stewardship of Mephisto, the Lord of Hatred, who was imprisoned within the Guardian Tower. Through the generations, these pious men slowly fell more and more under the sway of Mephisto's malevolent power and the Council became an evil mockery of its former glory.",
			"It is Mephisto's Hatred that has corrupted Zakarum and turned its devout followers into paranoid fanatics. That is why you must travel to the Temple City of Travincal and slay the Council. Once they are gone, Mephisto's hold over this land and its people will be broken!",
			"You must know that the Guardian Tower in the Temple City was built by the Horadrim for one purpose - to hold Mephisto. Once the Council is dead, you may enter the Tower.",
			"If you die on this quest, I will commemorate your sacrifice in an epic poem. You will not need a potion to achieve immortality. Ormus' words will do that.",
			"Ormus is grateful to you, stranger. You have broken the long, dark reign of Zakarum and delivered the first paralyzing blow against the Three. Yet still, the true test lies ahead. For he whom the Council guarded still lives within the Blackened Tower.",
			"Diablo and Baal have surely found the Temple City by now. They seek to free their Brother, Mephisto, who was imprisoned by the Horadrim in the Temple's Guardian Tower. You must reach him before his Brothers do and prevent them from releasing Hatred upon the world.",
			"Make haste! Though the Three are sure to reunite, it is uncertain as to what they have planned once they do.",
			"Be cautious, my friend. Though you are mighty, no mortal can stand alone against the power of the Prime Evils.",
			"I understand that the great Patriarch of Zakarum, Sankekur, now embodies Mephisto. You must overcome Hatred lest Terror and Destruction claim us all!",
			"I am loath to describe what will happen if Diablo and Baal release Mephisto.",
			"You have defeated a Prime Evil in combat. Ormus is impressed beyond words. But staying here will not end this conflict. You must enter the Infernal Gate and stop Diablo once and for all.",
			"Your salvation can only be reached through Hatred. A strange fate, but a true one.",
			"How does one destroy Destruction? How does one force Terror to flee in fear? You have great tasks ahead of you, Ormus thinks.",
			"The Church of Light harbors the darkest shadow of all. Tread lightly.",
			"When speaking of the dead, it is best to remain cryptic.",
			"The Travincal can be breached by the loss of one's wits, not by the use of them.",
			"Alkor is able to explain things much more clearly than Ormus.",
			"Asheara is both proud and self-conscious of her womanhood.",
			"Deckard Cain... Ormus has no time for the last son of the Horadrim. Pride led that holy Order to failure.",
			"Hratli suspects that Ormus is a mage. He can suspect whatever he wants, Ormus will not show him the true magic.",
			"For one who spends so much time away from home, Meshif has taken Kurast's corruption the hardest.",
			"The Church which you serve is corrupted by evil. Yet the holy disciplines it taught you may yet save us all.",
			"This is a strange time for heroes, Ormus thinks"
		]
	},
	"halbu": {
		"name": "Halbu",
		"quotes": [
			"Hail to you, Champion.",
			"What do you need?",
			"Hello."
		]
	},
	"jamella": {
		"name": "Jamella",
		"quotes": [
			"Hail to you, Champion.",
			"What do you need?",
			"Greetings."
		]
	},
	"anya": {
		"name": "Anya",
		"quotes": [
			"Many outsiders believe that the fantastic stories about our ancestors, The Ancients, are but fables. However I believe that the ancients are more than human, that mankind has fallen from it was once.",
			"When I was a child, the elders told us stories about the mountain and its power, and how the barbarian people are bound to it as protectors. Baal is not just taking our land, with every step he takes up the mountain he takes a part of who we are as people.",
			"I'm truly glad you're here warrior. Perhaps things would be different now if we had ask for assistance from our neighbored kingdoms... our foolish, foolish pride.",
			"My father, Aust, was among those elders wise enough to see that we would need outside help to deal with Baal's legions. He believed that this conflict would affect our entire world, not just our homeland. He said that Mount Arreat is as necessary to the world survival as food and water for our own. I believe this to be true.",
			"Qual-Kehk's confidence in his abilities once bordered on arrongance. But in the early days of the siege he was humbled by Baal, while he saved us from immediate destruction a third of our warriors were lost. None felt those losses more than he. Though he may not admit it, your presence gives him hope, warrior.",
			"If Larzuk could sing or dance half as well as he smithes, he'd be married by now, just look at those shoulders.",
			"Hero... Nihlathak did this to me. If you've come to help me... my only hope lies with Malah... please tell her you found me.",
			"Meet me in town... Hurry!",
			"Thank you Hero, for rescuing me. To show my personal gratitude I give you this, I have a custom made for you by Larzuk.",
			"Nihlathak told me, he struck a deal with Baal, to protect Harrogath. In exchange for the demons' mercy, the misguided fool plans to give Baal the relic of the ancients, our most holy totem, doing so will allow Baal to enter Mount Arreat to enter unchallenged by the Ancients.",
			"I tried to stop Nihlathak, but he imprisoned me in that Icy tomb. Nihlathak must be stopped before he dooms the whole world.",
			"As much as I would love to strangle the life out of him I'm afraid I haven't the strength, you must go to his lair through this portal I've opened. Kill him and the bring back the relic of the ancients, stop Nihlathak from destroying what we've striven for eons to protect.",
			"As noble as Nihlathak's intentions are, nothing can excuse his actions.",
			"Nihlathak is a traitor, if Baal gets the relic he shall enter the mountain and wreak havoc there. I cannot belive that Nihlathak would give the relic to Baal in any kind of trade. He's truly insane if he thinks he can deal with the Lord of Destruction.",
			"You have stopped Nihlathak, but he didn't have the Relic! He must have already given it to Baal. Now, Baal will not be tested when he reaches Arreat's summit. ...Damn Nihlathak!",
			"I do thank you for trying. Please allow me to honor your courage by magically inscribing your name onto an item of your choosing... It's the least I can do.",
			"You wouldn't have to test yourself against the ancients if it weren't for Nihlathak's treachery. He was a fool and deserves to suffer for eternity.",
			"Look... I must apologize. I feel responsible for your current troubles. If I had only stopped Nihlathak from giving Baal the relic, you would not have to fight those ghosts.",
			"You stand before me a worthy hero. And on you rest the last hope of our people... bear it well warrior.",
			"Baal has blocked Tyrael from entering the Worldstone Chamber? This truly has become a battle against hell. Whether or not it was the heaven's decree. This is your fight now... your destiny.",
			"You've done the impossible hero. Your defeat of the last of the three Prime Evils is a great victory for the light. Strange that you said that The Worldstone must be destroyed. The prophecy said nothing about that, perhaps only what we've fought for will be lost, or perhaps we will never need fight again."
		]
	},
	"larzuk": {
		"name": "Larzuk",
		"quotes": [
			"I am Larzuk, the armorer. My ancestors were some of the finest craftsmen in Harrogath. Regretfully, my supplies run lower with every passing day, yet the demons beyond the walls have not weakened. I fear the time is near when I must put down my hammer and take up a sword instead.",
			"So you're an amazon. I've heard rumors about your kind. Your unusual weapons could prove a challenge to my skills, but I'm prepared to meet them.",
			"Just so you know... The gold you pay me doesn't line my pockets. Much of it goes to buy the raw metal I need to melt down for weapons and armor. The rest - well all I can spare - goes to Malah and Qual-Kehk for other supplies.",
			"Nihlathak's despair is infectious - and his behavior does not befit an Elder of his stature. I think we'd be better off without him.",
			"I've offered Qual-Kehk my ideas on how to break the siege, but he dismisses them. Is it because I lack scars of battle, or does he think I'm a couple arrows short of a quiver?",
			"Demonic forces have been using our own towers and barricades against us. You know, it would be wise to cut the demons down in the open before they can mount those fortifications.",
			"This is a lively town during our victory celebrations. We barbarians train long and hard from childhood to become warriors, and we celebrate with equal fervor. You didn't happen to bring along any ale to trade?",
			"Has that infernal howling been keeping you awake at night, too? Some think it's the howling of animals, but those sounds don't come from any beast I've ever known.",
			"If you're here to defeat Baal, you must prove it. As we speak Harrogath is under siege by Baal's demons. catapults rain death just outside the town walls. Baal himself travels up the sacred mountain, having left in charge here one of his most vicious generals, Shenk the Overseer, a ruthless taskmaster, he lashes his own minions into suicidal frenzies on the battlefield. If you wish to prove yourself to us, destroy the monster Shenk that commands the infernal catapults outside Harrogath. If you manage to do this, return to me.",
			"Uh.. did I mention there were catapults?",
			"What's the matter hero? Questioning your fortitude? I know we are.",
			"You're an even greater warrior that I expected. Sorry for understimating you, as a token of my apreciation I will craft sockets into an item of your chosing. And from now on you'll get the best prices for all my wares.",
			"I crafted the swords and armor for Qual-Kehk's men, they were like brother to me. I can't imagine the pain they must be suffering. Save them if you can.",
			"As a kid I used to play solture on the barricades of the mountain. There is no easy way through that mass of walls.",
			"Since your arrival Cain has spoken of your deed in the southern kingdoms, defeating both Mephisto and Diablo. At first I scoffed at his tales, but I'm finding them more believable with every passing day.",
			"Anya is an amazing alchemist, specially for her young age. As long as I've known her she's never let anything to stop her from persuing what she believed in. I would doubt that Nihlathak is involved, ever since her father died, they haven't got along.",
			"As the daughter of elder Aust, Anya is the only person, besides Nihlathak, who has any real knowlegde of Mount Arreat's secrets. I'd hate to see our fate in the hands of Nihlathak alone.",
			"Poor Anya, I should've know Nihlathak was a traitor. If you find him alive, kill him for me.",
			"I never liked Nihlathak, but I never suspected that he'd betray us. I just can't understand how an elder can do such a thing.",
			"Now, rescuing Anya, that's good. Talking to me while Nihlathak hands over the relic to Baal... Uh that's bad.",
			"What's there to talk about? Kill Nihlathak!",
			"Hmm...What does Baal plan to do inside Mount Arreat?",
			"Every night I pray to The Ancients to bring us peace, now you must fight them. Who should I pray to now warrior?",
			"You've walked on the burial grounds of our greatest ancestors. I'm not sure whether I should bow before you or revile you for commiting sacrilege. Tread lightly when you walk with gods.",
			"The Ancients have honored you, and in turn so do we. I've no remaining doubts about you now.",
			"I may be just an armorer. But I know this, Baal plans to destroy the world with the secrets contain in that mountain. It doesn't take a genius to know he has to be stopped!",
			"The Ancients themselves will envy our songs about you. Please don't forget about us. Farewell my friend."
		]
	},
	"malah": {
		"name": "Malah",
		"quotes": [
			"You've traveled far, only to return home to us, Barbarian. Ohh... Much has happened in Harrogath since you left. Our Homeland is hardly recognizable with so much evil about.",
			"Yet, I've managed to survive so far. You've seen your share of suffering as well, I'm sure. Seeing you again --alive-- does my heart good. I shall pray that you can help us out of this hell.",
			"A Sorceress... here in Harrogath? There was a time, child, when I thought I was destined to follow your kind's path. However my powers never developed beyond the simplest of spells. Although I can heal any wound with time and energy, there is little I can do to help against Baal. But enough of that, I expend too much time in reflection and I've forgotten my manners.",
			"I, Malah, welcome you to Harrogath, the last stronghold of Order on Mount Arreat. You have come to the right place if you intend to defeat Baal, the Lord of Destruction.",
			"Baal has laid waste to our mountain and its denizens. His minions continue to attack our town, while Qual-Kehk and his men have proven helpless to stop them. Baal is still out on the mountain looking for something -- but I know not what.",
			"All of the Elders, save Nihlathak, sacrificed themselves to place a protective ward around Harrogath.",
			"Some of us here, certainly Nihlathak, do not appreciate your presence. We are a proud people, and it is not easy for us to accept aid. I, however, am glad you are here.",
			"If you need healing or a potion, please come to me. See Larzuk for weapons, armors, and repairs, Nihlathak, despite his disposition, may be of some assistance with his other wares. Finally, Qual-Kehk, our Man-At-Arms, leads Harrogath's forces against Baal.",
			"Your gold is most helpful. Medical supplies for our wounded are scarce and very expensive. When we can find a supplier, oh we must pay dearly for what we need.",
			"Be cautious, warrior. Though I am an experienced healer, resurrection is beyond my powers.",
			"Perhaps you have heard the accounts of my son's horrible death at the hands of Baal's minions. He was my last living child... The oath of compassion I have taken as a healer extends only to humankind. Cut them down, warrior. All of them!",
			"The Catapults are infernal machines made of demon flesh fused with steel. Be wary of them.",
			"I pray for the day when the fields are covered in snow unstained by the blood of our own. Perhaps that day will come soon...Perhaps never... Oh...But I forget myself. How may I aid your quest?",
			"This battle plays mind tricks on our warriors. Those fortunate enough to have returned from the mountainside claim to have seen angels in flight. Fly they might, but that certainly does not make them angels.",
			"With the exception of Qual-Kehk, the townspeople do not see what I see -- the massacre we face. Our bravest, strongest heroes hobble back to me begging for help. I do what I can -- healing and bandaging some, preparing the others for what lies ahead.",
			"Larzuk possesses a good soul, but at times his mind seems quite unsound. He once asked me for 20 of my finest sheep's skins. He said he would fill them with hot air and float like a cloud above the battlefield to spy on Baal's legions. I worry the siege has driven him mad.",
			"Qual-Kehk is a worthy leader, but the losses has bond heavily upon him. He is only impatient because he judges the worth of a warrior by actions, not words. You must prove yourself worthy of his trust.",
			"On the battlefield, turning your back on even the dead is unwise.",
			"Though once considered shelter by our people, the Ice caves are for no refuge from the dark horde. There are creatures that will freeze your heart before feasting upon it.",
			"I know you and my son, Bannuk, did not part on the best of terms. He did not understand the wanderlust that drove you to leave your homeland. However, even though Bannuk could never admit it to me, as he grew older, I could see the same desire in his eyes. Oh... it's a pity I didn't encourage him to go with you. He might still be alive today.",
			"Qual-Kehk and his men have been fighting to break the siege for some time. Where many have failed, you may succesed.",
			"This may not be very encouraging, but you have fared better than the others who passed through those gates. In Regards to Shenk the Overseer, remember, a general is nothing without his men.",
			"Oh, at last the siege has ended. You truly are an angel. I thank you.",
			"Qual-Kehk's men have been imprisoned for some time. They're certain to be tired and weak. You must protect them once you free them.",
			"Soldiers who made it back, told of a system made of barricades place amount the mountain passes. They said that is where the prisoners are held.",
			"You have inspired the people in this town, not only those you rescued. But those you helped in other ways as well.",
			"There is a matter of which I hesitate to share. I believe you're the only one who can help me now. Anya, the young alchemist and daughter to one of our slain elders, has been missing for some time. She is a strong crafty woman, with a spirit like no other. One night, just before your arrival, I overheard her and Nihlathak arguing about her father's death.",
			"The next morning, she was gone. Nihlathak has his own tale as to where she went and why. Don't believe him! I fear he's at the root of her disappearance. Please if you can, search for Anya and bring her back to us. She'll know what to do about Nihlathak.",
			"When you talk to Nihlathak, be careful. there is no telling what he would say or do.",
			"If it were anyone else, I would assume her dead. However, Anya is not easily beaten, I know she must be alive.",
			"So, that snake Nihlathak was behind Anya's disappearance, and he trapped her with a freezing curse. Here, take this potion to Anya and give it to her. That should release her.",
			"Thank you so much for bringing Anya back to us. I have devised this spell to increase your resistances as a token of my thanks. I know it isn't much, but I hope you find it helpful. Please go talk to Anya. She has urgent news concerning Nihlathak.",
			"My worst fear has come true Nihlathak has gone mad. You must stop him, before he gives the Relic to the Lord of Destruction.",
			"Nihlathak was never the kindest man, but for him to betray the whole world. Where shall his soul finally rest?",
			"So, the Relic is lost. Do not dwell on failures past. It is your future that matters more.",
			"By reaching the Summit, just ceased being just a simple warrior. When you come back, you will be far more.",
			"Do not doubt yourself, I believe you're worthy to pass through the Ancient's gates. But you must believe as well.",
			"I knew the Ancients would find you worthy of Mount Arreat's secrets. Now stop Baal, before he destroy all that is sacred.",
			"You knew it will eventually come down to this. Kill Baal. Finish the game.",
			"If Tyrael says the Worldstone must be destroyed, then it must. We cannot let Baal's corruption prevail. The World will change, true. But who is to says isn't for the better."
		]
	},
	"nihlathak": {
		"name": "Nihlathak",
		"quotes": [
			"Well, well. The siege has everything in short supply...except fools. Why would you seek this place, stranger? Are you a vulture come to loot the bodies of our fallen warriors? Regardless, this is no place to make a name for yourself. The mountain is ours to protect. It is only a matter of time before Hell's legions are routed.",
			"Ah, a Necromancer. While I admire your courage in seeking out the darkest side of magic, we really have little need for your skill. The Battle will turn soon enough without your meddling. Yet I should have expected to see your kind here. You're like a moth to the flame, drawn to all this death. It feeds you in more ways than one, does it not?",
			"Well, well. An assassin. Well I'm sure we are all grateful for your presence in our troubled town, you need not have made the journey. I can personally say that your skills are not required here. You would serve your clan better elsewhere.",
			"Qual-Kehk is useless. He has blindly sent our warriors to their deaths, assuming Baal's legions would fight as men do. Of course, everyone knows they do not.",
			"The demon hordes have grown powerful beyond measure, aided by our foolish mistakes. But I may have found a way to correct those mistakes...",
			"If you have nothing useful for me, be on your way!",
			"The Council of Elders always believed itself prepared for the coming of the Three. Obviously, we were not prepared enough.",
			"Oh yes...I remember our warriors as children. Malah would set their broken bones and give them powders for their fevers. Now, they return to her with wounds that will never heal. I am tired...Please...leave me.",
			"I have long been criticized, but especially of late -- since the deaths of my fellow Elders. Through it all, I have learned one thing. Each man must do what's right, no matter what others may think.",
			"After so many have died, who are you to think you can accomplish what our warriors could not?",
			"What are you still doing here? I thought you were going off to die. Go...Be quick about it.",
			"Ending the siege does not earn immediate respect, outsider. Respect only comes with sacrifice -- something I'm sure you know nothing of.",
			"You have proven you can take life, warrior, but can you save it as well?",
			"Did you ever stop to think why these demons are capturing Qual-Kehk's men? Why they are attacking us? Have you considered what Baal wants with the mountain? No. You've not. You have no idea what you are dealing with.",
			"So. You brought the lost sheep home to the shepherd. Well done.",
			"Anya! Who have you been talking to? Likely, It was that meddling Malah. Well, I'll tell you what really happened. Anya came to me for guidance, after receiving a vision that her mother and younger brother were trapped in the lands beyond the Ice Caves. She had decided to go rescue them.",
			"I told her that her quest was a foolish one and that she would be safer staying within the city walls. However, she is a willful girl and would not listen to me. The next morning, she was gone. No one is more distraught than I over losing her. However, if you feel the need to be Malah's errand child, I won't try to stop you.",
			"Look, I've told you! She's dead! If you knew what was good for you, you'd concentrate your efforts on saving Harrogath -- not on lost causes like Anya.",
			"You have no idea of the power you face.",
			"I shall keep my end of Baal's bargain.",
			"For my homeland!",
			"I will KILL you!"
		]
	},
	"qual-kehk": {
		"name": "Qual-Kehk",
		"quotes": [
			"I am Qual-Kehk, the Senior Man-At-Arms of Harrogath. You have the look of a warrior. An extra soldier would be useful, but don't expect anyone to mourn if you get yourself killed. Baal is true to his namesake. He has ravaged through our lands like a merciless plague.",
			"The protective ward laid down by our elders has helped hold the evil at bay, but Baal's siege has taken its toll all the same. Most of my men are now dead. Others are trapped in the mountain passes. But I swear we are not beaten yet. We will fight to the end to protect the mountain!",
			"A Druid in Harrogath! Have things truly come to this? After the Mage Wars, I assumed Druids would never be seen around here again. You take a great risk coming here! To be honest, I have never been in comfort with your shape-shifting kind, but I do respect your search for balance and peace. So, if you trust us enough to let you enter our gates, then I trust you enough to let you stay.",
			"A Paladin! I've long heard of your people. As a young warrior I even considered a pilgrimage to Kurast, but I was younger then, and foolish. My place has always been here, protecting Harrogath and Mount Arreat with it.",
			"Baal's legions seems countless, but slaying their commanders takes some of the fight out of them.",
			"We have lost many well trained warriors to Baal's siege machines. Their range is great. Though, they are vulnerable if close the distance quickly enough.",
			"This is unlike any battle I have ever fought. While we ration food and water, the demon hordes feast nightly on the flesh and blood of our dead.",
			"Larzuk is a talented blacksmith, but his head is full of some strange ideas. Just the other day he came to me with a plan to break the siege. He wanted to fill large pipes exploding powders and steel balls, then...Well like I said, strange.",
			"The death of Malah's son was a great tragedy. He was our finest archer. While leading a successful campaign against Baal's forces, he was impaled on a demon's spear. The wound was such that...Well, even Malah herself acknowledges that quick death was a blessing.",
			"Early on, parties of our best scouts were ambushed by demons that spawned from the very air around them. Survivors often mentioned a strange creature floating in the distance. Perhaps taking it down could prevent some nasty surprises.",
			"Harrogath has great need of your powers, noble Druid. However, in the face of this supernatural onslaught, are your natural powers up to the task?",
			"It would be an honor to have a warrior of the light, fighting side by side with my men. I can see your faith give you great strength Paladin, but don't expect to keep you out of harm's way.",
			"About to face Shenk the Overseer and stop the siege, are you? You should ask Malah to perform your last rites before you go, stranger.",
			"So, you still live... You're either quick, or a coward.",
			"So, you've managed to stop the siege. You're more powerful that I gave you credit for, you've rightfully earn my respect.",
			"My concerns have turned to my men taken prisoner on the battlefield by Baal's demons. I hate to think what's happened to them. As you journey up the mountain keep your eyes open for my soldiers and bring them back to me if you can.",
			"Those of my men fortunate enough to escape on their own told me that they were captive in the Highland in the Plateaus.",
			"They said that discretion, not procrastination. Is the better part of valor.",
			"More of my men are still alive out there, I'm certain of it. Find them, free them from their cages and bring them back to me.",
			"Thank you for rescuing my men. They've spoken well of your bravery in battle. Perhaps there is hope for us after all. If you wish you may hire some of my mercenaries that you've saved.",
			"And please take this set of runes I've been saving them for a socketed shield but I think you'll make better use of them. Be sure to socket them in the right order for its fullest effect.",
			"Anya's father, Aust, was our wisest elder. He was killed along with the other elders who erected a ward to protect the city. The ward has kept Baal's demons out of Harrogath but at the cost of their sacrifice.",
			"Nihlathak, on the other hand, was the only elder to escape the demons. Somehow he alone manage to find sanctuary while the others died around him, ever since that day Nihlathak and Anya have been at odds.",
			"It seems like everyone feel Nihlathak played a part in Anya's disappearance. Why would he do such a thing?",
			"The snake has slipped our grasp, while you where gone Nihlathak disappeared. I'll bet Anya knows how to track him down.",
			"I saw Nihlathak leave town just before you found Anya, he must be held accountable for his criminal deeds. Find him and bring him back if you can, likely he won't come willingly and you'd be force to kill him... So be it.",
			"My advice is to go in quick, and hit hard. Nihlathak can't be half as tough as the beasts you faced out there.",
			"Nihlathak was a vile demon that shall find his place among the tortured demons of Hell! You battled the darkness without fear. I laud your skill and courage.",
			"The Ancients are not our enemies, remember that. They're our ancestors, our gods.",
			"I warned you, The Ancients are not like the demons you are accustommed to fighting.",
			"Every time I hear of you warrior, your deeds become more legendary. But take heed, you're approaching the very summit of Mount Arreat. I have never dared to enter there, it is sacred, our most holy place.",
			"The legends said that it is guarded by the ancients ones who block the path of all who are unworthy. Your reputation here does not matter, it will be the ancients who determine your worthiness, Good Luck.",
			"Besting The Ancients in battle is a mighty feat indeed. I hope this means you're ready to battle Baal.",
			"You've ventured to a place beyond legend, you rush to face an evil few can even imagine. Be careful my friend, and may the light watch over you.",
			"The Destruction of the Worldstone does not bode well for our world, but I'll try not to worry. After all we have warriors like you fighting for our side, and for the light. Farewell."
		]
	},
	"adria": {
		"name": "Adria",
		"quotes": [
		"I sense a soul in search of answers...",
		"Wisdom is earned, not given. If you discover a tome of knowledge, devour its words. Should you already have knowledge of the arcane mysteries scribed within a book, remember - that level of mastery can always increase.",
		"The greatest power is often the shortest lived. You may find ancient words of power written upon scrolls of parchment. The strength of these scrolls lies in the ability of either apprentice or adept to cast them with equal ability. Their weakness is that they must first be read aloud and can never be kept at the ready in your mind. Know also that these scrolls can be read but once, so use them with care.",
		"Though the heat of the sun is beyond measure, the mere flame of a candle is of greater danger. No energies, no matter how great, can be used without the proper focus. For many spells, ensorcelled Staves may be charged with magical energies many times over. I have the ability to restore their power - but know that nothing is done without a price.",
		"The sum of our knowledge is in the sum of its people. Should you find a book or scroll that you cannot decipher, do not hesitate to bring it to me. If I can make sense of it I will share what I find.",
		"To a man who only knows Iron, there is no greater magic than Steel. The blacksmith Griswold is more of a sorcerer than he knows. His ability to meld fire and metal is unequaled in this land.",
		"Corruption has the strength of deceit, but innocence holds the power of purity. The young woman Gillian has a pure heart, placing the needs of her matriarch over her own. She fears me, but it is only because she does not understand me.",
		"A chest opened in darkness holds no greater treasure than when it is opened in the light. The storyteller Cain is an enigma, but only to those who do not look. His knowledge of what lies beneath the cathedral is far greater than even he allows himself to realize.",
		"The higher you place your faith in one man, the farther it has to fall. Farnham has lost his soul, but not to any demon. It was lost when he saw his fellow townspeople betrayed by the Archbishop Lazarus. He has knowledge to be gleaned, but you must separate fact from fantasy.",
		"The hand, the heart and the mind can perform miracles when they are in perfect harmony. The healer Pepin sees into the body in a way that even I cannot. His ability to restore the sick and injured is magnified by his understanding of the creation of elixirs and potions. He is as great an ally as you have in Tristram.",
		"There is much about the future we cannot see, but when it comes it will be the children who wield it. The boy Wirt has a blackness upon his soul, but he poses no threat to the town or its people. His secretive dealings with the urchins and unspoken guilds of nearby towns gain him access to many devices that cannot be easily found in Tristram. While his methods may be reproachful, Wirt can provide assistance for your battle against the encroaching Darkness.",
		"Earthen walls and thatched canopy do not create a home. The innkeeper Ogden serves more of a purpose in this town than many understand. He provides shelter for Gillian and her matriarch, maintains what life Farnham has left to him, and provides an anchor for all who are left in the town to what Tristram once was. His tavern, and the simple pleasures that can still be found there, provide a glimpse of a life that the people here remember. It is that memory that continues to feed their hopes for your success."
		]
	},
	"wirt": {
		"name": "Wirt",
		"quotes": [
		"Pssst... over here...",
		"Not everyone in Tristram has a use - or a market - for everything you will find in the labyrinth. Not even me, as hard as that is to believe. Sometimes, only you will be able to find a purpose for some things.",
		"Don't trust everything the drunk says. Too many ales have fogged his vision and his good sense.",
		"In case you haven't noticed, I don't buy anything from Tristram. I am an importer of quality goods. If you want to peddle junk, you'll have to see Griswold, Pepin or that witch, Adria. I'm sure that they will snap up whatever you can bring them...",
		"I guess I owe the blacksmith my life - what there is of it. Sure, Griswold offered me an apprenticeship at the smithy, and he is a nice enough guy, but I'll never get enough money to... well, let's just say that I have definite plans that require a large amount of gold.",
		"If I were a few years older, I would shower her with whatever riches I could muster, and let me assure you I can get my hands on some very nice stuff. Gillian is a beautiful girl who should get out of Tristram as soon as it is safe. Hmmm... maybe I'll take her with me when I go...",
		"Cain knows too much. He scares the life out of me - even more than that woman across the river. He keeps telling me about how lucky I am to be alive, and how my story is foretold in legend. I think he's off his crock.",
		"Farnham - now there is a man with serious problems, and I know all about how serious problems can be. He trusted too much in the integrity of one man, and Lazarus led him into the very jaws of death. Oh, I know what it's like down there, so don't even start telling me about your plans to destroy the evil that dwells in that Labyrinth. Just watch your legs...",
		"As long as you don't need anything reattached, old Pepin is as good as they come. If I'd have had some of those potions he brews, I might still have my leg...",
		"Adria truly bothers me. Sure, Cain is creepy in what he can tell you about the past, but that witch can see into your past. She always has some way to get whatever she needs, too. Adria gets her hands on more merchandise than I've seen pass through the gates of the King's Bazaar during High Festival.",
		"Ogden is a fool for staying here. I could get him out of town for a very reasonable price, but he insists on trying to make a go of it with that stupid tavern. I guess at the least he gives Gillian a place to work, and his wife Garda does make a superb Shepherd's pie.."
		]
	},
	"pepin": {
		"name": "Pepin",
		"quotes": [
		"What ails you, my friend?",
		"I have made a very interesting discovery. Unlike us, the creatures in the Labyrinth can heal themselves without the aid of potions or magic. If you hurt one of the monsters, make sure it is dead or it very well may regenerate itself.",
		"Before it was taken over by, well, whatever lurks below, the Cathedral was a place of great learning. There are many books to be found there. If you find any, you should read them all, for some may hold secrets to the workings of the Labyrinth.",
		"Griswold knows as much about the art of war as I do about the art of healing. He is a shrewd merchant, but his work is second to none. Oh, I suppose that may be because he is the only blacksmith left here.",
		"Cain is a true friend and a wise sage. He maintains a vast library and has an innate ability to discern the true nature of many things. If you ever have any questions, he is the person to go to.",
		"Even my skills have been unable to fully heal Farnham. Oh, I have been able to mend his body, but his mind and spirit are beyond anything I can do.",
		"While I use some limited forms of magic to create the potions and elixirs I store here, Adria is a true sorceress. She never seems to sleep, and she always has access to many mystic tomes and artifacts. I believe her hut may be much more than the hovel it appears to be, but I can never seem to get inside the place.",
		"Poor Wirt. I did all that was possible for the child, but I know he despises that wooden peg that I was forced to attach to his leg. His wounds were hideous. No one - and especially such a young child - should have to suffer the way he did.",
		"I really don't understand why Ogden stays here in Tristram. He suffers from a slight nervous condition, but he is an intelligent and industrious man who would do very well wherever he went. I suppose it may be the fear of the many murders that happen in the surrounding countryside, or perhaps the wishes of his wife that keep him and his family where they are.",
		"Ogden's barmaid is a sweet girl. Her grandmother is quite ill, and suffers from delusions. She claims that they are visions, but I have no proof of that one way or the other."
		]
	},
	"ogden": {
		"name": "Ogden",
		"quotes": [
		"Thank goodness you've returned! Much has changed since you lived here, my friend. All was peaceful until the dark riders came and destroyed our village. Many were cut down where they stood, and those who took up arms were slain or dragged away to become slaves - or worse. The church at the edge of town has been desecrated and is being used for dark rituals. The screams that echo in the night are inhuman, but some of our townsfolk may yet survive. Follow the path that lies between my tavern and the blacksmith shop to find the church and save who you can. Perhaps I can tell you more if we speak again. Good luck.",
		"Greetings, good master. Welcome to the Tavern of the Rising Sun!",
		"Many adventurers have graced the tables of my tavern, and ten times as many stories have been told over as much ale. The only thing that I ever heard any of them agree on was this old axiom. Perhaps it will help you. You can cut the flesh, but you must crush the bone.",
		"Griswold the blacksmith is extremely knowledgeable about weapons and armor. If you ever need work done on your gear, he is definitely the man to see.",
		"Farnham spends far too much time here, drowning his sorrows in cheap ale. I would make him leave, but he did suffer so during his time in the Labyrinth.",
		"Adria is wise beyond her years, but I must admit - she frightens me a little. Well, no matter. If you ever have need to trade in items of sorcery, she maintains a strangely well-stocked hut just across the river.",
		"If you want to know more about the history of our village, the storyteller Cain knows quite a bit about the past.",
		"Wirt is a rapscallion and a little scoundrel. He was always getting into trouble, and it's no surprise what happened to him. He probably went fooling about someplace that he shouldn't have been. I feel sorry for the boy, but I don't abide the company that he keeps.",
		"Pepin is a good man - and certainly the most generous in the village. He is always attending to the needs of others, but trouble of some sort or another does seem to follow him wherever he goes...",
		"Gillian, my Barmaid? If it were not for her sense of duty to her grand-dam, she would have fled from here long ago. Goodness knows I begged her to leave, telling her that I would watch after the old woman, but she is too sweet and caring to have done so."
		]
	},
	"griswold": {
		"name": "Griswold",
		"quotes": [
		"Well, what can I do for ya?",
		"If you're looking for a good weapon, let me show this to you. Take your basic blunt weapon, such as a mace. Works like a charm against most of those undying horrors down there, and there's nothing better to shatter skinny little skeletons!",
		"The axe? Aye, that's a good weapon, balanced against any foe. Look how it cleaves the air, and then imagine a nice fat demon head in its path. Keep in mind, however, that it is slow to swing - but talk about dealing a heavy blow!",
		"Look at that edge, that balance. A sword in the right hands, and against the right foe, is the master of all weapons. Its keen blade finds little to hack or pierce on the undead, but against a living, breathing enemy, a sword will better slice their flesh!",
		"Your weapons and armor will show the signs of your struggles against the Darkness. If you bring them to me, with a bit of work and a hot forge, I can restore them to top fighting form.",
		"While I have to practically smuggle in the metals and tools I need from caravans that skirt the edges of our damned town, that witch, Adria, always seems to get whatever she needs. If I knew even the smallest bit about how to harness magic as she did, I could make some truly incredible things.",
		"Gillian is a nice lass. Shame that her gammer is in such poor health or I would arrange to get both of them out of here on one of the trading caravans.",
		"Sometimes I think that Cain talks too much, but I guess that is his calling in life. If I could bend steel as well as he can bend your ear, I could make a suit of court plate good enough for an Emperor!",
		"I was with Farnham that night that Lazarus led us into Labyrinth. I never saw the Archbishop again, and I may not have survived if Farnham was not at my side. I fear that the attack left his soul as crippled as, well, another did my leg. I cannot fight this battle for him now, but I would if I could.",
		"A good man who puts the needs of others above his own. You won't find anyone left in Tristram - or anywhere else for that matter - who has a bad thing to say about the healer.",
		"That lad is going to get himself into serious trouble... or I guess I should say, again. I've tried to interest him in working here and learning an honest trade, but he prefers the high profits of dealing in goods of dubious origin. I cannot hold that against him after what happened to him, but I do wish he would at least be careful.",
		"The Innkeeper has little business and no real way of turning a profit. He manages to make ends meet by providing food and lodging for those who occasionally drift through the village, but they are as likely to sneak off into the night as they are to pay him. If it weren't for the stores of grains and dried meats he kept in his cellar, why, most of us would have starved during that first year when the entire countryside was overrun by demons."
		]
	},
	"gillian": {
		"name": "Gillian",
		"quotes": [
		"Good day! How may I serve you?",
		"The woman at the edge of town is a witch! She seems nice enough, and her name, Adria, is very pleasing to the ear, but I am very afraid of her. It would take someone quite brave, like you, to see what she is doing out there.",
		"My grandmother had a dream that you would come and talk to me. She has visions, you know and can see into the future.",
		"Our Blacksmith is a point of pride to the people of Tristram. Not only is he a master craftsman who has won many contests within his guild, but he received praises from our King Leoric himself - may his soul rest in peace. Griswold is also a great hero; just ask Cain.",
		"Cain has been the storyteller of Tristram for as long as I can remember. He knows so much, and can tell you just about anything about almost everything.",
		"Farnham is a drunkard who fills his belly with ale and everyone else's ears with nonsense.",
		"I know that both Pepin and Ogden feel sympathy for him, but I get so frustrated watching him slip farther and farther into a befuddled stupor every night.",
		"Pepin saved my grandmother's life, and I know that I can never repay him for that. His ability to heal any sickness is more powerful than the mightiest sword and more mysterious than any spell you can name. If you ever are in need of healing, Pepin can help you.",
		"I grew up with Wirt's mother, Canace. Although she was only slightly hurt when those hideous creatures stole him, she never recovered. I think she died of a broken heart. Wirt has become a mean-spirited youngster, looking only to profit from the sweat of others. I know that he suffered and has seen horrors that I cannot even imagine, but some of that darkness hangs over him still.",
		"Ogden and his wife have taken me and my grandmother into their home and have even let me earn a few gold pieces by working at the inn. I owe so much to them, and hope one day to leave this place and help them start a grand hotel in the east"
		]
	},
	"farnham": {
		"name": "Farnham",
		"quotes": [
		"Can't a fella drink in peace?",
		"No one ever lis... listens to me. Somewhere - I ain't too sure - but somewhere under the church is a whole pile o' gold. Gleamin' and shinin' and just waitin' for someone to get it.",
		"I know you gots your own ideas, and I know you're not gonna believe this, but that weapon you got there - it just ain't no good against those big brutes! Oh, I don't care what Griswold says, they can't make anything like they used to in the old days...",
		"If I was you... and I ain't... but if I was, I'd sell all that stuff you got and get out of here. That boy out there... He's always got somethin good, but you gotta give him some gold or he won't even show you what he's got.",
		"The gal who brings the drinks? Oh, yeah, what a pretty lady. So nice, too.",
		"Why don't that old crone do somethin' for a change. Sure, sure, she's got stuff, but you listen to me... she's unnatural. I ain't never seen her eat or drink - and you can't trust somebody who doesn't drink at least a little.",
		"Cain isn't what he says he is. Sure, sure, he talks a good story... some of 'em are real scary or funny... but I think he knows more than he knows he knows.",
		"Griswold? Good old Griswold. I love him like a brother! We fought together, you know, back when... we... Lazarus... Lazarus... Lazarus!!!",
		"Hehehe, I like Pepin. He really tries, you know. Listen here, you should make sure you get to know him. Good fella like that with people always wantin' help. Hey, I guess that would be kinda like you, huh hero? I was a hero too...",
		"Wirt is a kid with more problems than even me, and I know all about problems. Listen here - that kid is gotta sweet deal, but he's been there, you know? Lost a leg! Gotta walk around on a piece of wood. So sad, so sad...",
		"Ogden is the best man in town. I don't think his wife likes me much, but as long as she keeps tappin' kegs, I'll like her just fine. Seems like I been spendin' more time with Ogden than most, but he's so good to me...",
		"I wanna tell ya sumthin', 'cause I know all about this stuff. It's my specialty. This here is the best... theeeee best! That other ale ain't no good since those stupid dogs.."
		]
	},
	"gharbad": {
		"name": "Gharbad the Weak",
		"quotes": [
			"Pleeeease, no hurt, no kill. Keep alive and next time good bring to you.",
			"Something for you I am making. Again, not kill Gharbad, live and give good. You take this as proof I keep word...",
			"Nothing yet! Almost done. Very powerful, very strong. Live! Live! No pain and promise I keep!",
			"This too good for you. Very powerful! You want - you take!"
		]
	},
	"templar": {
		"name": "",
		"quotes": [
			"My order would approve.",
			"You set a shining example.",
			"That was well done.",
			"A worthy deed.",
			"I am proud.",
			"All glory to you.",
			"To the death!",
			"You end here!",
			"For honor and glory!",
			"Now we fight!",
			"Draw your weapons!",
			"Blades out!",
			"For the order!",
			"I'll see your heart!",
			"The Light take you!",
			"Now for your just reward!",
			"For all that is holy!",
			"For all that is right!",
			"For the innocent!",
			"For the just!",
			"By the laws of Heaven!",
			"By my soul!",
			"Salvation by the Light alone!",
			"By my honor!",
			"For my salvation!",
			"Do your worst!",
			"For glory!",
			"I shall impale you!",
			"I am your destruction!",
			"Meet your destiny!",
			"Meet your fate!",
			"Slither to your death!",
			"By my oath!",
			"Your death, my glory!",
			"Forward!",
			"There! A worthy foe!",
			"By all that is holy! Do you see that enemy over there?",
			"A mighty adversary is before us.",
			"Hah! A good hit!",
			"Look at that! My hand is sure!",
			"A mighty blow against the darkness!",
			"Take that, you fiend!",
			"I bleed?",
			"I'm wounded!",
			"I do not fear pain!",
			"Blood, hah!",
			"Nothing more than a scratch!",
			"I go to the light!",
			"Westmarch calls to me...",
			"Darkness... closing in...",
			"A pall of ancient doom hangs upon these woods.",
			"That was invigorating.",
			"Is that all?",
			"I expected more.",
			"Evil has been rebuked.",
			"The Light grows.",
			"The world is a safer place.",
			"That was all of them!",
			"I could do that again!",
			"Not even a sweat.",
			"Just a skirmish. Give me a real battle!",
			"Farewell.",
			"Stand in glory.",
			"Stay in the Light.",
			"Honor always.",
			"The journey continues.",
			"My blessings.",
			"The darkness grows while we stand about.",
			"I cannot follow you if we just stand around.",
			"When virtue tarries, evil smiles.",
			"Surely there is someone out there who would benefit from our aid right now.",
			"Evil does not rest. Neither should we.",
			"It is good to fight with you again.",
			"Let us seek honor together, my friend.",
			"That was a worthy foe. Glorious.",
			"A worthy opponent.",
			"What a monstrous creature!",
			"Could we find more like that?",
			"We have done it!",
			"My power grows!",
			"Once again, I become stronger.",
			"I grow stronger in the Light!",
			"Another step upon the path to glory!",
			"Greater and greater!",
			"Within me, the Light grows stronger!",
			"Great effort brings great reward!",
			"I grow stronger.",
			"My power grows great.",
			"Glory to you.",
			"The Light grows stronger within you!",
			"A glorious development.",
			"The air hangs heavy with the scent of terror. This does not bode well.",
			"What skill should I master?",
			"How should I train?",
			"Die, fiend!",
			"No mercy!"
		]
	},
	"scoundrel": {
		"name": "",
		"quotes": [
			"Almost as good as me.",
			"Hey, you're not so bad.",
			"I'm impressed.",
			"Didn't know you had it in you.",
			"You remind me of... me.",
			"When did you get so good?",
			"Keep it up.",
			"You'd do well in the guild.",
			"I'm in!",
			"For the gold!",
			"Here's to unfair fights!",
			"I'll be taking that!",
			"Your gold will be mine!",
			"Let's brawl!",
			"You'll never see me coming!",
			"No chance.",
			"You'll regret this!",
			"Kill, then steal? Or steal, then kill?",
			"You want to fight? Let's fight!",
			"For Kingsport!",
			"What's yours is mine!",
			"Dodge this!",
			"Do your worst!",
			"For gold!",
			"For treasure!",
			"For profit!",
			"Do your worst!",
			"Here's hoping you've got gold!",
			"Kingsport fighting!",
			"I'm here! I'm there! Take this!",
			"Want some?",
			"I don't fight fair.",
			"Here we go!",
			"They have no chance!",
			"Look at that thing over there! Let's kill it!",
			"That opponent there must have wonderful treasure!",
			"That's quite an enemy over there! We are in for a fight.",
			"Didn't expect that strike, now, did you?",
			"That must have hurt!",
			"Did you see that hit?",
			"That's how we fight in Kingsport!",
			"I should have been... a baker.",
			"The deal went... sour.",
			"Don't take... my... things.",
			"We have a word back home for people who fail like that.",
			"I don't care for these woods. Must we slog through them?",
			"That was fun.",
			"Is that all?",
			"I expected more.",
			"That was all of them!",
			"I'm not even tired.",
			"I could do that again!",
			"We did it!",
			"I thought that went well.",
			"Well, what treasure did they have?",
			"You almost make theft unnecessary!",
			"Don't do anything I wouldn't do.",
			"Stay in the shadows.",
			"Never let them catch you.",
			"Be swift; be silent.",
			"Take what you can. Never apologize.",
			"May fortune find you.",
			"If we stand here much longer, I am going to rob you. Just so you know.",
			"Very pretty view here. The scenery is... interesting in these parts. The ground isare we going to do anything?",
			"I was caught stealing once. Once!",
			"Do you ever think about making positive changes in your life? I don't.",
			"You know, I have some important deals happening soon. I could go take care of those and come back later.",
			"They will run when they see us!",
			"Let us seek our fortunes together.",
			"That's how we do it in Kingsport.",
			"Fine work!",
			"I never doubted us for a moment.",
			"Cheers!",
			"A hard fight. Time to loot!",
			"I'm even better.",
			"I didn't think I could get better, but here I am.",
			"I'm getting better.",
			"On to bigger things!",
			"Someday I'll run Kingsport!",
			"Someday I'll run the guild!",
			"Better and better!",
			"Fate smiles on me today!",
			"I always knew I had it in me.",
			"You're not as bad as you look.",
			"Someday you'll be as good as me!",
			"I'll reform! I swear I'll never... Oh, I'm alive?",
			"I almost went to the great Thieves Guild in the sky.",
			"I knew that couldn't be the end of me.",
			"Let's do this righter, more right.",
			"Should we try something different this time?",
			"A new beginning.",
			"Time to start over again... again.",
			"Are we certain we want to go through these caves? Something is not right here...",
			"Treasure!",
			"My thief sense is tingling.",
			"Over there! Riches!",
			"I smell treasure.",
			"Let me check the treasure.",
			"What should I train?",
			"What skill should I use?",
			"You're going to regret crossing me!",
			"Let's see them survive this!"
		]
	},
	"enchantress": {
		"name": "",
		"quotes": [
			"Masterfully done.",
			"Fine work.",
			"Just so.",
			"Good.",
			"I am proud of you.",
			"That was justly done.",
			"The Prophet would be pleased.",
			"My sisters would approve.",
			"That was well done.",
			"Impressive deeds.",
			"For the Prophet!",
			"To the death!",
			"Now we fight!",
			"Die!",
			"Meet your destiny!",
			"Meet your fate!",
			"For my sisters!",
			"I bring the Prophet's wrath!",
			"Evil shall perish!",
			"Taste my anger!",
			"Strive against the darkness! ",
			"Death awaits you.",
			"I am the hand of the Prophet!",
			"Feel my wrath!",
			"I am coming for you.",
			"Death stalks you.",
			"Cower before us!",
			"This ends here!",
			"For the sisterhood!",
			"You haven't a prayer!",
			"I can wait no longer!",
			"I have a spell for you!",
			"To your death!",
			"Your end is nigh!",
			"To the end!",
			"The Prophet foretold your death!",
			"Meet eternity.",
			"I have heard whispers of your death!",
			"The Prophet has foretold my victory!",
			"How do you wish to die?",
			"Do you see that enemy over there? Let us cleanse it from this land.",
			"Look, just over there! I never imagined such a creature.",
			"That is a powerful foe over there.",
			"A fine strike!",
			"That spell shall silence you!",
			"Your death is sure after that hit!",
			"A perfect hit!",
			"The darkness returns...",
			"No... I have more yet to do...",
			"This cannot be the end...",
			"Did you really mean to do that?",
			"I do not believe that was right.",
			"You should not have done that.",
			"The Prophet frowns upon that.",
			"I would do that differently. More correctly, I mean.",
			"These woods are ominous and old... even older than my time.",
			"My spirits have lifted!",
			"Is that all?",
			"I thought there would be more.",
			"We taught them a lesson.",
			"Your valor inspired me.",
			"We make a fine team.",
			"We have done it!",
			"We have survived!",
			"We have won!",
			"Victory!",
			"Perfect.",
			"Yes.",
			"A lovely piece.",
			"You are too kind.",
			"This is well crafted.",
			"Thank you.",
			"If you insist.",
			"I will use this.",
			"A gift?",
			"Magnificent!",
			"Farewell, my friend.",
			"It was an honor.",
			"I hope to see you again soon.",
			"It was my pleasure to spend time with you.",
			"Many blessings.",
			"May grace light your path.",
			"I waited for fifteen hundred years for this. Should I return to my slumber?",
			"I imagined that the hero of prophecy would be more... lively.",
			"The Prophet did not mention what a bore you can be.",
			"One time I miscast the charm spell, and Sister Lysa was fawning over me for a fortnight. It was mortifying!",
			"Should I find some new attire? These old things are becoming so small...",
			"I welcome the chance to travel with you.",
			"Let us fight this evil together.",
			"A most thrilling battle.",
			"That is what I have trained for!",
			"A powerful enemy we have laid low.",
			"I learned much from that.",
			"A mighty foe has fallen.",
			"I have grown in wisdom.",
			"My power has grown!",
			"Surely I have pleased the Prophet!",
			"I have improved!",
			"Diligence has its reward!",
			"I have ascended!",
			"Magnificent! My power grows.",
			"My sisters would envy me!",
			"I studied hard for this!",
			"I studied hard for this!",
			"Well done!",
			"My respects.",
			"Most impressive!",
			"The darkness fades... I see again!",
			"The weakness has left me. I will fight once more!",
			"It was not yet my time.",
			"Let us begin anew.",
			"This time we shall improve, no?",
			"Let us choose the path wisely.",
			"Let us start again.",
			"Death waits for many here.",
			"Treasure!",
			"I see riches ahead!",
			"That treasure could be of use to us.",
			"Riches await us.",
			"You must choose my skill.",
			"I require a new skill.",
			"This will slow their bloodlust!",
			"We shall cleanse this blight!"
		]
	},
	"other": {
		"name": "",
		"quotes": [
			"Joshua: We just spent a week fighting off hundreds of walking corpses outside our impenetrable gates. We're the hardest bastards within a hundred miles. Who's going to attack us?"
	 ]
	}
}
